{"id":2097,"date":"2016-07-21T09:00:17","date_gmt":"2016-07-21T09:00:17","guid":{"rendered":"http:\/\/dev.westamerica.com\/?p=2097"},"modified":"2019-04-25T21:04:36","modified_gmt":"2019-04-25T21:04:36","slug":"westamerica-bancorporation-reports-second-quarter-2016-financial-results","status":"publish","type":"post","link":"https:\/\/www.westamerica.com\/westamerica-bancorporation-reports-second-quarter-2016-financial-results\/","title":{"rendered":"Westamerica Bancorporation Reports Second Quarter 2016 Financial Results"},"content":{"rendered":"\n<p>For Immediate Release&nbsp;<\/p>\n\n\n\n<p>San Rafael, CA: Westamerica Bancorporation (<a href=\"http:\/\/quotes.nasdaq.com\/Quote.dll?page=multi&amp;mode=stock&amp;mode=Stock&amp;symbol=WABC%00\" target=\"_blank\" rel=\"noreferrer noopener\">NASDAQ: WABC<\/a>), parent company of Westamerica Bank, generated net income for the second quarter 2016 of $14.5 million and diluted earnings per common share (&#8220;EPS&#8221;) of $0.57, compared to net income of $14.2 million and EPS of $0.56 for the prior quarter, and net income of $14.8 million and EPS of $0.58 for the second quarter 2015.<\/p>\n\n\n\n<p>&#8220;Westamerica’s revenue stream was stable from the first quarter 2016 to the second quarter 2016, with fully-taxable equivalent net interest income and noninterest income totaling $48.2 million for both quarters. Credit quality improved with nonperforming assets declining to $18.1 million at June 30, 2016 from $26.4 million at March 31, 2016. Noninterest expenses declined $630 thousand from the first quarter 2016 to the second quarter 2016,” said Chairman, President and CEO David Payne. “With stable revenues and reduced expenses, Westamerica delivered higher net income for our shareholders, generating an annualized return on shareholders’ common equity of 11 percent for the second quarter 2016. Westamerica paid its shareholders a $0.39 per share dividend in the second quarter,” concluded Payne.<\/p>\n\n\n\n<p>The annualized net interest margin on a fully taxable equivalent basis was 3.27 percent for the second quarter 2016, compared to 3.34 percent for the prior quarter, and 3.37 percent for the second quarter 2015. Net interest income on a fully taxable equivalent basis was $36.5 million for the second quarter 2016, compared to $36.4 million for the prior quarter, and $37.4 million for the second quarter 2015. The Company’s loan portfolio has declined from the second quarter 2015 through the second quarter 2016; Management has been avoiding long-dated, low-yielding loans given historically low interest rates. Management has also maintained conservative loan underwriting, terms and conditions. During this period, the investment portfolio has grown. The changing composition of interest earning assets and low market interest rates has pressured the net interest margin. The funding cost of deposits and other interest-bearing borrowings, as a percentage of average loans and investment securities, was 0.05 percent for the second quarter 2016, unchanged from the prior quarter and down from 0.06 percent for the second quarter 2015.<\/p>\n\n\n\n<p>The provision for loan losses was zero for the second quarter 2016, unchanged from the prior quarter and second quarter 2015. Net loan losses charged against the allowance for loan losses totaled $577 thousand for the second quarter 2016, compared to $284 thousand for the prior quarter and $359 thousand for the second quarter 2015. At June 30, 2016, the allowance for loan losses totaled $28.9 million and nonperforming loans totaled $13.9 million.<\/p>\n\n\n\n<p>Noninterest income for the second quarter 2016 totaled $11.7 million, essentially unchanged from the prior quarter, and compared to $12.3 million for the second quarter 2015.<\/p>\n\n\n\n<p>Noninterest expense for the second quarter 2016 totaled $25.2 million, compared to $25.9 million for the prior quarter, and $26.9 million for the second quarter 2015. Personnel costs were lower for the second quarter 2016 compared to the first quarter 2016 due to seasonally higher payroll taxes in the first quarter 2016. Personnel costs were lower for the second quarter 2016 compared to the second quarter 2015 due to lower insurance related costs. For the second quarter 2016, the cost of holding other real estate owned was offset by gains realized on the liquidation of properties.<\/p>\n\n\n\n<p>At June 30, 2016, Westamerica Bancorporation&#8217;s tangible common equity-to-asset ratio was 8.5 percent, and assets totaled $5.2 billion. Westamerica Bancorporation, through its wholly owned subsidiary Westamerica Bank, operates commercial banking and trust offices throughout Northern and Central California.<\/p>\n\n\n\n<p><a href=\"\/wp-content\/uploads\/2019\/02\/2ndqfinhi16.pdf\" target=\"_blank\" rel=\"noreferrer noopener\" aria-label=\" (opens in a new tab)\">Quarterly Financial Highlights&nbsp;<\/a><\/p>\n\n\n\n<h2>FORWARD-LOOKING INFORMATION:<\/h2>\n\n\n\n<p>The following appears in accordance with the Private Securities Litigation Reform Act of 1995:<\/p>\n\n\n\n<p>This press release may contain forward-looking statements about the Company, including descriptions of plans or objectives of its management for future operations, products or services, and forecasts of its revenues, earnings or other measures of economic performance. Forward-looking statements can be identified by the fact that they do not relate strictly to historical or current facts. They often include the words &#8220;believe,&#8221; &#8220;expect,&#8221; &#8220;anticipate,&#8221; &#8220;intend,&#8221; &#8220;plan,&#8221; &#8220;estimate,&#8221; or words of similar meaning, or future or conditional verbs such as &#8220;will,&#8221; &#8220;would,&#8221; &#8220;should,&#8221; &#8220;could,&#8221; or &#8220;may.&#8221;<\/p>\n\n\n\n<p>Forward-looking statements, by their nature, are subject to risks and uncertainties. A number of factors — many of which are beyond the Company&#8217;s control — could cause actual conditions, events or results to differ significantly from those described in the forward-looking statements. The Company&#8217;s most recent reports filed with the Securities and Exchange Commission, including the annual report for the year ended December 31, 2015 filed on Form 10-K and quarterly report for the quarter ended March 31, 2016 filed on Form 10-Q, describe some of these factors, including certain credit, interest rate, operational, liquidity and market risks associated with the Company&#8217;s business and operations. Other factors described in these reports include changes in business and economic conditions, competition, fiscal and monetary policies, disintermediation, legislation including the Dodd-Frank Wall Street Reform and Consumer Protection Act of 2011, the Sarbanes-Oxley Act of 2002 and the Gramm-Leach-Bliley Act of 1999, and mergers and acquisitions.<\/p>\n\n\n\n<p>Forward-looking statements speak only as of the date they are made. The Company does not undertake to update forward-looking statements to reflect circumstances or events that occur after the date forward looking statements are made.<\/p>\n\n\n\n<h3>For additional information contact:<\/h3>\n\n\n\n<p>Westamerica Bancorporation<br>Robert A. Thorson, Senior Vice President and Chief Financial Officer, (707) 863-6840<br>E-mail:&nbsp;<a href=\"mailto:investments@westamerica.com\">investments@westamerica.com<\/a><\/p>\n","protected":false},"excerpt":{"rendered":"<p>For Immediate Release&nbsp; San Rafael, CA: Westamerica Bancorporation (NASDAQ: WABC), parent company of Westamerica Bank, generated net income for the second quarter 2016 of $14.5 million and diluted earnings per common share (&#8220;EPS&#8221;) of $0.57, compared to net income of $14.2 million and EPS of $0.56 for the prior quarter, and net income of $14.8 &hellip;<\/p>\n<p class=\"read-more\"> <a class=\"\" href=\"https:\/\/www.westamerica.com\/westamerica-bancorporation-reports-second-quarter-2016-financial-results\/\"> <span class=\"screen-reader-text\">Westamerica Bancorporation Reports Second Quarter 2016 Financial Results<\/span> Read More &raquo;<\/a><\/p>\n","protected":false},"author":3,"featured_media":0,"comment_status":"closed","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/www.westamerica.com\/wp-json\/wp\/v2\/posts\/2097"}],"collection":[{"href":"https:\/\/www.westamerica.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.westamerica.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.westamerica.com\/wp-json\/wp\/v2\/users\/3"}],"replies":[{"embeddable":true,"href":"https:\/\/www.westamerica.com\/wp-json\/wp\/v2\/comments?post=2097"}],"version-history":[{"count":3,"href":"https:\/\/www.westamerica.com\/wp-json\/wp\/v2\/posts\/2097\/revisions"}],"predecessor-version":[{"id":3429,"href":"https:\/\/www.westamerica.com\/wp-json\/wp\/v2\/posts\/2097\/revisions\/3429"}],"wp:attachment":[{"href":"https:\/\/www.westamerica.com\/wp-json\/wp\/v2\/media?parent=2097"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.westamerica.com\/wp-json\/wp\/v2\/categories?post=2097"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.westamerica.com\/wp-json\/wp\/v2\/tags?post=2097"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}