{"id":2107,"date":"2016-01-21T09:00:19","date_gmt":"2016-01-21T09:00:19","guid":{"rendered":"http:\/\/dev.westamerica.com\/?p=2107"},"modified":"2019-04-25T22:49:59","modified_gmt":"2019-04-25T22:49:59","slug":"westamerica-bancorporation-reports-fourth-quarter-2015-financial-results","status":"publish","type":"post","link":"https:\/\/www.westamerica.com\/westamerica-bancorporation-reports-fourth-quarter-2015-financial-results\/","title":{"rendered":"Westamerica Bancorporation Reports Fourth Quarter 2015 Financial results"},"content":{"rendered":"\n<p>For Immediate Release&nbsp;<\/p>\n\n\n\n<p>San Rafael, CA: Westamerica Bancorporation (<a href=\"http:\/\/quotes.nasdaq.com\/Quote.dll?page=multi&amp;mode=stock&amp;mode=Stock&amp;symbol=WABC%00\" target=\"_blank\" rel=\"noreferrer noopener\">NASDAQ: WABC<\/a>), parent company of Westamerica Bank, generated net income for the fourth quarter 2015 of $14.6 million and diluted earnings per common share (&#8220;EPS&#8221;) of $0.57, compared to net income of $14.9 million and EPS of $0.58 for the prior quarter, and net income of $15.0 million and EPS of $0.58 for the fourth quarter 2014.<\/p>\n\n\n\n<p>&#8220;Westamerica’s net interest margin stabilized at 3.32 percent for the fourth quarter 2015 compared to 3.31 percent in the prior quarter; yields on loans and investment securities were little changed while the margin was supported by a relatively low 0.05 percent cost of funding our interest generating assets. Lower-cost checking and savings deposits continued to grow in the fourth quarter 2015, and represented 94 percent of total deposits at December 31, 2015. Westamerica’s credit quality remained stable at healthy levels throughout the fourth quarter 2015, requiring no provision for loan losses, and our operating expenses represented only 53 percent of our revenues during the quarter,” said Chairman, President and CEO David Payne. “Our operating results generated an annualized return on shareholders’ common equity of 11 percent for the fourth quarter 2015, and Westamerica increased its quarterly shareholder dividend to $0.39 per share,” concluded Payne.<\/p>\n\n\n\n<p>The annualized net interest margin on a fully taxable equivalent basis was 3.32 percent for the fourth quarter 2015, compared to 3.31 percent for the prior quarter and 3.53 percent for the fourth quarter 2014. Net interest income on a fully taxable equivalent basis was $36.7 million for the fourth quarter 2015, compared to $37.2 million for the prior quarter, and $37.3 million for the fourth quarter 2014. The yields on the Company’s interest earning loans and investment securities were pressured by low market interest rates during 2015. During this period, the Company avoided long-dated, low-yielding loans given the expectation for rising interest rates; the Company also reduced its exposure to rising interest rates by purchasing shorter-duration investment securities. The funding cost of deposits and other interest-bearing borrowings, as a percentage of average loans and investment securities, was 0.05 percent for the fourth quarter 2015, unchanged from the prior quarter and down from 0.08 percent for the fourth quarter 2014.<\/p>\n\n\n\n<p>The provision for loan losses was zero for the fourth quarter 2015, unchanged from the prior quarter, and down from $200 thousand for the fourth quarter 2014. Net loan losses charged against the allowance for loan losses totaled $265 thousand for the fourth quarter 2015, compared to $792 thousand for the prior quarter and $484 thousand for the fourth quarter 2014. At December 31, 2015, the allowance for loan losses totaled $30 million and nonperforming loans totaled $15.3 million.<\/p>\n\n\n\n<p>Noninterest income for the fourth quarter 2015 totaled $11.3 million, compared to $12.0 million for the prior quarter, and $12.5 million for the fourth quarter 2014. The decline in noninterest income is due to declines in service charges on deposit accounts and merchant processing fees.<\/p>\n\n\n\n<p>Noninterest expense for the fourth quarter 2015 totaled $25.5 million, compared to $26.2 million for the prior quarter and $26.4 million for the fourth quarter 2014. The decline in noninterest expense is due to declines in personnel costs and other operating expenses.<\/p>\n\n\n\n<p>At December 31, 2015, Westamerica Bancorporation&#8217;s tangible common equity-to-asset ratio was 7.9 percent, and assets totaled $5.2 billion. Westamerica Bancorporation, through its wholly owned subsidiary Westamerica Bank, operates commercial banking and trust offices throughout Northern and Central California.<\/p>\n\n\n\n<p><a href=\"\/wp-content\/uploads\/2019\/02\/4thqfinihi2015.pdf\" target=\"_blank\" rel=\"noreferrer noopener\" aria-label=\" (opens in a new tab)\">Quarterly Financial Highlights&nbsp;<\/a><\/p>\n\n\n\n<h2>FORWARD-LOOKING INFORMATION:<\/h2>\n\n\n\n<p>The following appears in accordance with the Private Securities Litigation Reform Act of 1995:<\/p>\n\n\n\n<p>This press release may contain forward-looking statements about the Company, including descriptions of plans or objectives of its management for future operations, products or services, and forecasts of its revenues, earnings or other measures of economic performance. Forward-looking statements can be identified by the fact that they do not relate strictly to historical or current facts. They often include the words &#8220;believe,&#8221; &#8220;expect,&#8221; &#8220;anticipate,&#8221; &#8220;intend,&#8221; &#8220;plan,&#8221; &#8220;estimate,&#8221; or words of similar meaning, or future or conditional verbs such as &#8220;will,&#8221; &#8220;would,&#8221; &#8220;should,&#8221; &#8220;could,&#8221; or &#8220;may.&#8221;<\/p>\n\n\n\n<p>Forward-looking statements, by their nature, are subject to risks and uncertainties. A number of factors — many of which are beyond the Company&#8217;s control — could cause actual conditions, events or results to differ significantly from those described in the forward-looking statements. The Company&#8217;s most recent reports filed with the Securities and Exchange Commission, including the annual report for the year ended December 31, 2014 filed on Form 10-K and quarterly report for the quarter ended September 30, 2015 filed on Form 10-Q, describe some of these factors, including certain credit, interest rate, operational, liquidity and market risks associated with the Company&#8217;s business and operations. Other factors described in these reports include changes in business and economic conditions, competition, fiscal and monetary policies, disintermediation, legislation including the Dodd-Frank Wall Street Reform and Consumer Protection Act of 2011, the Sarbanes-Oxley Act of 2002 and the Gramm-Leach-Bliley Act of 1999, and mergers and acquisitions.<\/p>\n\n\n\n<p>Forward-looking statements speak only as of the date they are made. The Company does not undertake to update forward-looking statements to reflect circumstances or events that occur after the date forward looking statements are made.<\/p>\n\n\n\n<h3><strong>For additional information contact:<\/strong><\/h3>\n\n\n\n<p>Westamerica Bancorporation<br><strong>Robert A. Thorson<\/strong>, Senior Vice President and Chief Financial Officer, (707) 863-6840<br>E-mail:&nbsp;<a href=\"mailto:investments@westamerica.com\">investments@westamerica.com<\/a><\/p>\n","protected":false},"excerpt":{"rendered":"<p>For Immediate Release&nbsp; San Rafael, CA: Westamerica Bancorporation (NASDAQ: WABC), parent company of Westamerica Bank, generated net income for the fourth quarter 2015 of $14.6 million and diluted earnings per common share (&#8220;EPS&#8221;) of $0.57, compared to net income of $14.9 million and EPS of $0.58 for the prior quarter, and net income of $15.0 &hellip;<\/p>\n<p class=\"read-more\"> <a class=\"\" href=\"https:\/\/www.westamerica.com\/westamerica-bancorporation-reports-fourth-quarter-2015-financial-results\/\"> <span class=\"screen-reader-text\">Westamerica Bancorporation Reports Fourth Quarter 2015 Financial results<\/span> Read More &raquo;<\/a><\/p>\n","protected":false},"author":3,"featured_media":0,"comment_status":"closed","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/www.westamerica.com\/wp-json\/wp\/v2\/posts\/2107"}],"collection":[{"href":"https:\/\/www.westamerica.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.westamerica.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.westamerica.com\/wp-json\/wp\/v2\/users\/3"}],"replies":[{"embeddable":true,"href":"https:\/\/www.westamerica.com\/wp-json\/wp\/v2\/comments?post=2107"}],"version-history":[{"count":3,"href":"https:\/\/www.westamerica.com\/wp-json\/wp\/v2\/posts\/2107\/revisions"}],"predecessor-version":[{"id":3434,"href":"https:\/\/www.westamerica.com\/wp-json\/wp\/v2\/posts\/2107\/revisions\/3434"}],"wp:attachment":[{"href":"https:\/\/www.westamerica.com\/wp-json\/wp\/v2\/media?parent=2107"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.westamerica.com\/wp-json\/wp\/v2\/categories?post=2107"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.westamerica.com\/wp-json\/wp\/v2\/tags?post=2107"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}