{"id":2132,"date":"2014-10-15T09:00:43","date_gmt":"2014-10-15T09:00:43","guid":{"rendered":"http:\/\/dev.westamerica.com\/?p=2132"},"modified":"2019-04-25T23:04:32","modified_gmt":"2019-04-25T23:04:32","slug":"westamerica-bancorporation-reports-third-quarter-2014-financial-results","status":"publish","type":"post","link":"https:\/\/www.westamerica.com\/westamerica-bancorporation-reports-third-quarter-2014-financial-results\/","title":{"rendered":"Westamerica Bancorporation Reports Third Quarter 2014 Financial Results"},"content":{"rendered":"\n<p>For Immediate Release&nbsp;<\/p>\n\n\n\n<p>&nbsp;San Rafael, CA: Westamerica Bancorporation (<a href=\"http:\/\/quotes.nasdaq.com\/Quote.dll?page=multi&amp;mode=stock&amp;mode=Stock&amp;symbol=WABC%00\" target=\"_blank\" rel=\"noreferrer noopener\">NASDAQ: WABC<\/a>), parent company of Westamerica Bank, generated net income for the third quarter 2014 of $15.2 million and diluted earnings per common share (&#8220;EPS&#8221;) of $0.58, virtually unchanged from the prior quarter.<\/p>\n\n\n\n<p>&#8220;Westamerica’s credit quality improved with nonperforming assets totaling $26 million at September 30, 2014, down from $30 million at June 30, 2014 and $52 million at September 30, 2013. With this improvement in credit quality, we reduced our loan loss provision to $600 thousand for the third quarter 2014. Our net interest margin was 3.66 percent in the third quarter, down from 3.76 percent in the prior quarter. Low market interest rates continue to pressure our net interest margin, particularly the securities portfolio yield as we purchase shorter-duration, lower-yielding securities to prepare for rising interest rates. We continue to focus on controlling operating costs while providing superior customer service; our third quarter 2014 expenses were down $341 thousand from the prior quarter and down $1.1 million from the third quarter 2013,” said Chairman, President and CEO David Payne. “Our third quarter 2014 earnings delivered a relatively high annualized return on common equity of 11.5 percent for our shareholders, and we paid a $0.38 per share dividend during the quarter,” concluded Payne.<\/p>\n\n\n\n<p>Net interest income on a fully taxable equivalent (“FTE”) basis was $37.9 million for the third quarter 2014, compared to $38.6 million for the prior quarter and $41.2 million for the third quarter 2013. Net interest income declined as market interest rates on many loan products remain below the yields earned on older-dated loans and on the overall loan portfolio. The Company is reducing its exposure to rising interest rates by purchasing shorter-duration investment securities which carry lower yields than longer-duration securities. The annualized interest cost of funding the Company&#8217;s loans and investment securities was 0.08 percent for the third quarter 2014, down from 0.09 percent from the prior quarter, and down from 0.11 percent for the third quarter 2013. The annualized net interest margin on a fully taxable equivalent basis was 3.66 percent for the third quarter 2014, compared to 3.76 percent for the prior quarter and 4.01 percent for the third quarter 2013.<\/p>\n\n\n\n<p>The provision for loan losses was $600 thousand for the third quarter 2014, down from $1.0 million for the prior quarter, and down from $1.8 million for the third quarter 2013. Net loan losses charged against the allowance for loan losses totaled $1.2 million for the third quarter 2014, compared to $711 thousand for the prior quarter and $810 thousand for the third quarter 2013. The increase in net loan losses in the third quarter 2014 is due to the charge-off of one nonaccrual loan. At September 30, 2014, the allowance for loan losses totaled $31.8 million; nonperforming originated loans totaled $5.1 million; and nonperforming purchased loans totaled $13.7 million, net of purchase discounts of $298 thousand.<\/p>\n\n\n\n<p>Noninterest income for the third quarter 2014 totaled $13.1 million, compared to $13.2 million for the prior quarter and $14.4 million for the third quarter 2013. Noninterest income was higher in the third quarter 2013 due to higher merchant processing service fees, higher service charges on deposit accounts, and higher loan principal recoveries exceeding purchase date fair values (included in “other noninterest income”).<\/p>\n\n\n\n<p>Noninterest expense for the third quarter 2014 totaled $26.6 million, compared to $27.0 million in the prior quarter and $27.8 million for the third quarter 2013. Noninterest expense has declined due to lower OREO costs (net of gains on sale of repossessed loan collateral) and lower personnel costs.<\/p>\n\n\n\n<p>At September 30, 2014, Westamerica Bancorporation&#8217;s tangible common equity-to-asset ratio was 8.2 percent, assets totaled $5.0 billion and loans outstanding totaled $1.7 billion. Westamerica Bancorporation, through its wholly owned subsidiary Westamerica Bank, operates commercial banking and trust offices throughout Northern and Central California.<\/p>\n\n\n\n<p><a href=\"\/wp-content\/uploads\/2019\/02\/3rdqfinhi14.pdf\" target=\"_blank\" rel=\"noreferrer noopener\" aria-label=\" (opens in a new tab)\">Quarterly Financial Highlights&nbsp;<\/a><\/p>\n\n\n\n<h2>FORWARD-LOOKING INFORMATION:<\/h2>\n\n\n\n<p>The following appears in accordance with the Private Securities Litigation Reform Act of 1995:<\/p>\n\n\n\n<p>This press release may contain forward-looking statements about the Company, including descriptions of plans or objectives of its management for future operations, products or services, and forecasts of its revenues, earnings or other measures of economic performance. Forward-looking statements can be identified by the fact that they do not relate strictly to historical or current facts. They often include the words &#8220;believe,&#8221; &#8220;expect,&#8221; &#8220;anticipate,&#8221; &#8220;intend,&#8221; &#8220;plan,&#8221; &#8220;estimate,&#8221; or words of similar meaning, or future or conditional verbs such as &#8220;will,&#8221; &#8220;would,&#8221; &#8220;should,&#8221; &#8220;could,&#8221; or &#8220;may.&#8221;<\/p>\n\n\n\n<p>Forward-looking statements, by their nature, are subject to risks and uncertainties. A number of factors — many of which are beyond the Company&#8217;s control — could cause actual conditions, events or results to differ significantly from those described in the forward-looking statements. The Company&#8217;s most recent reports filed with the Securities and Exchange Commission, including the annual report for the year ended December 31, 2013 filed on Form 10-K and quarterly report for the quarter ended June 30, 2014 filed on Form 10-Q, describe some of these factors, including certain credit, interest rate, operational, liquidity and market risks associated with the Company&#8217;s business and operations. Other factors described in these reports include changes in business and economic conditions, competition, fiscal and monetary policies, disintermediation, legislation including the Dodd-Frank Wall Street Reform and Consumer Protection Act of 2011, the Sarbanes-Oxley Act of 2002 and the Gramm-Leach-Bliley Act of 1999, and mergers and acquisitions.<\/p>\n\n\n\n<p>Forward-looking statements speak only as of the date they are made. The Company does not undertake to update forward-looking statements to reflect circumstances or events that occur after the date forward looking statements are made.<\/p>\n\n\n\n<h3><strong>For additional information contact:<\/strong><\/h3>\n\n\n\n<p>Westamerica Bancorporation<br><strong>Robert A. Thorson<\/strong>, Senior Vice President and Chief Financial Officer, (707) 863-6840<br>E-mail:&nbsp;<a href=\"mailto:investments@westamerica.com\">investments@westamerica.com<\/a><\/p>\n","protected":false},"excerpt":{"rendered":"<p>For Immediate Release&nbsp; &nbsp;San Rafael, CA: Westamerica Bancorporation (NASDAQ: WABC), parent company of Westamerica Bank, generated net income for the third quarter 2014 of $15.2 million and diluted earnings per common share (&#8220;EPS&#8221;) of $0.58, virtually unchanged from the prior quarter. &#8220;Westamerica’s credit quality improved with nonperforming assets totaling $26 million at September 30, 2014, &hellip;<\/p>\n<p class=\"read-more\"> <a class=\"\" href=\"https:\/\/www.westamerica.com\/westamerica-bancorporation-reports-third-quarter-2014-financial-results\/\"> <span class=\"screen-reader-text\">Westamerica Bancorporation Reports Third Quarter 2014 Financial Results<\/span> Read More &raquo;<\/a><\/p>\n","protected":false},"author":3,"featured_media":0,"comment_status":"closed","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/www.westamerica.com\/wp-json\/wp\/v2\/posts\/2132"}],"collection":[{"href":"https:\/\/www.westamerica.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.westamerica.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.westamerica.com\/wp-json\/wp\/v2\/users\/3"}],"replies":[{"embeddable":true,"href":"https:\/\/www.westamerica.com\/wp-json\/wp\/v2\/comments?post=2132"}],"version-history":[{"count":4,"href":"https:\/\/www.westamerica.com\/wp-json\/wp\/v2\/posts\/2132\/revisions"}],"predecessor-version":[{"id":3445,"href":"https:\/\/www.westamerica.com\/wp-json\/wp\/v2\/posts\/2132\/revisions\/3445"}],"wp:attachment":[{"href":"https:\/\/www.westamerica.com\/wp-json\/wp\/v2\/media?parent=2132"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.westamerica.com\/wp-json\/wp\/v2\/categories?post=2132"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.westamerica.com\/wp-json\/wp\/v2\/tags?post=2132"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}