{"id":4515,"date":"2020-04-16T15:58:43","date_gmt":"2020-04-16T15:58:43","guid":{"rendered":"https:\/\/www.westamerica.com\/?p=4515"},"modified":"2020-04-16T15:58:44","modified_gmt":"2020-04-16T15:58:44","slug":"westamerica-bancorporation-reports-first-quarter-2020-financial-results","status":"publish","type":"post","link":"https:\/\/www.westamerica.com\/westamerica-bancorporation-reports-first-quarter-2020-financial-results\/","title":{"rendered":"Westamerica Bancorporation Reports First Quarter 2020 Financial Results"},"content":{"rendered":"\n<p>SAN RAFAEL, CA: Westamerica Bancorporation (<a rel=\"noreferrer noopener\" href=\"http:\/\/quotes.nasdaq.com\/Quote.dll?page=multi&amp;mode=stock&amp;mode=Stock&amp;symbol=WABC%00\" target=\"_blank\">Nasdaq: WABC<\/a>),  parent company of Westamerica Bank, generated net income for the first quarter 2020 of $17.0 million and diluted earnings per common share (&#8220;EPS&#8221;) of $0.63. First quarter 2020 results include a provision for credit losses of $4.3 million, which reduced EPS $0.11, representing Management’s estimate of additional reserves needed over the remaining life of its loans due to increased credit-risk from deteriorating economic conditions caused by the Covid-19 pandemic. These results compare to net income of $20.7 million and EPS of $0.77 for the fourth quarter 2019 and net income of $19.6 million and EPS of $0.73 for the first quarter 2019. <\/p>\n\n\n\n<p>&#8220;Westamerica’s primary objective during the Covid-19 pandemic is to operate without interruption for our customers. As of today, our staffing levels are unaffected, our operating systems remain fully functional, and all but one of our branches are open. The business environment is highly uncertain at this time given the Covid-19 impacts on society and the economy. Westamerica’s annualized net interest margin increased to 3.10 percent for the first quarter 2020 from 3.08 percent in the fourth quarter 2019. Operating expenses were $24.7 million for the first quarter 2020, representing only 47 percent of revenues on a fully-taxable equivalent basis. First quarter 2020 results generated an annualized 9.7 percent return on average common equity, and shareholders were paid a $0.41 per common share dividend during the quarter,” said Chairman, President and CEO David Payne. “The well-being of our customers, employees and communities is of principal concern during this difficult period,” concluded Payne.<\/p>\n\n\n\n<p>Net interest income on a fully-taxable equivalent (FTE) basis was $40.5 million for the first quarter 2020, compared to $40.5 million for the fourth quarter 2019 and $40.2 million for the first quarter 2019. The annualized net interest margin (FTE) was 3.10 percent for the first quarter 2020, compared to 3.08 percent for the fourth quarter 2019 and 3.12 percent for the first quarter 2019. The Federal Open Market Committee (“FOMC”) reduced the interest rate paid on required reserves and excess reserve balances to 0.10 percent on March 16, 2020, which reduced the interest earned on Westamerica’s interest-bearing cash balances. Westamerica has taken loan applications under the United States Small Business Administration’s Paycheck Protection Program. Westamerica’s interest-bearing loans and investment securities are funded exclusively by shareholders’ equity and customers’ deposits. Checking and savings deposits represented ninety-six percent of the Company’s average deposit base during the first quarter 2020. Average deposit volumes during the first quarter 2020 of $4,829 million were stable compared to average deposit volumes during the fourth quarter 2019 and first quarter 2019 of $4,840 million and $4,835 million, respectively. The Company has no debt.<\/p>\n\n\n\n<p>The Company adopted Accounting Standards Update 2016-13, “Financial Instruments – Credit Losses: Measurement of Credit Losses on Financial Instruments” (“CECL”), effective January 1, 2020 with a net-of-tax increase to shareholders’ equity of $52 thousand. The Covid-19 environment, which developed after the CECL implementation, has caused deteriorating economic conditions, including a record number of California-based initial claims for unemployment in March 2020. Management expects developing increases in unemployment to result in higher credit-related losses, particularly consumer installment loans. The Company has been actively working with consumer and commercial borrowers requesting deferral of loan payments. The Company recognized a $4.3 million provision for credit losses in the first quarter 2020 representing Management’s estimate of additional reserves needed over the remaining life of its loans due to increased credit-risk from deteriorating economic conditions caused by the Covid-19 pandemic.<\/p>\n\n\n\n<p>Noninterest income for the\nfirst quarter 2020 totaled $11.6 million, compared to $11.7 million for the fourth\nquarter 2019, and $11.6 million for the first quarter 2019. First quarter 2020\nnon-interest income includes a $603 thousand receipt on a purchased loan,\nrepresenting the recovery of a purchased loan credit-risk discount. During the\nmonth of March 2020, activity-based fees related to deposit accounts and\nmerchant processing fees were lower due to reduced economic activity related to\nthe Covid-19 pandemic.<\/p>\n\n\n\n<p>Noninterest expense for\nthe first quarter 2020 was $455 thousand higher than noninterest expense for\nthe fourth quarter 2019 due to higher personnel costs offset in part by lower\nprofessional fees. Noninterest expense for the first quarter 2020 was $519\nthousand lower than noninterest expense for the first quarter 2019 due to lower\noccupancy and equipment costs, professional fees, FDIC assessments and amortization\nof intangible assets. First quarter 2020 noninterest expense reflects\napplication of a $246 thousand FDIC insurance assessment credit; the Company’s credit\nis fully exhausted.<\/p>\n\n\n\n<p>The tax rate (FTE) applied\nto pre-tax income (FTE) was 27.0 percent for the first quarter 2020, compared to\n26.0 percent for the fourth quarter 2019 and 26.3 percent for the first quarter\n2019. The lower tax rate for the fourth quarter 2019 is due to a customary\nadjustment to true-up the Company’s 2018 estimated tax provision to the filed\n2018 tax return. The lower tax rate for the first quarter 2019 is due to higher\ntax deductions from the exercise of employee stock options.<\/p>\n\n\n\n<p>Westamerica Bancorporation’s wholly owned subsidiary Westamerica Bank, operates commercial banking and trust offices throughout Northern and Central California.<\/p>\n\n\n\n<p><a href=\"\/wp-content\/uploads\/2020\/04\/Q1-20-Financial-Highlights.pdf\" target=\"_blank\" aria-label=\" (opens in a new tab)\" rel=\"noreferrer noopener\" class=\"aioseop-link\">Quaterly Financial Highlights<\/a><\/p>\n\n\n\n<p>FORWARD-LOOKING INFORMATION:<\/p>\n\n\n\n<p>The following appears in accordance with the Private Securities Litigation Reform Act of 1995:<\/p>\n\n\n\n<p>This press release may contain forward-looking statements about the Company, including descriptions of plans or objectives of its management for future operations, products or services, and forecasts of its revenues, earnings or other measures of economic performance. Forward-looking statements can be identified by the fact that they do not relate strictly to historical or current facts. They often include the words “believe,” “expect,” “anticipate,” “intend,” “plan,” “estimate,” or words of similar meaning, or future or conditional verbs such as “will,” “would,” “should,” “could,” or “may.”<\/p>\n\n\n\n<p>Forward-looking statements, by their nature, are subject to risks and uncertainties. A number of factors — many of which are beyond the Company’s control — could cause actual conditions, events or results to differ significantly from those described in the forward-looking statements. The Company’s most recent reports filed with the Securities and Exchange Commission, including the annual report for the year ended December 31, 2018 filed on Form 10-K and quarterly report for the quarter ended September 30, 2018 filed on Form 10-Q, describe some of these factors, including certain credit, interest rate, operational, liquidity and market risks associated with the Company’s business and operations. Other factors described in these reports include changes in business and economic conditions, competition, fiscal and monetary policies, disintermediation, cyber security risks, legislation including the Dodd-Frank Wall Street Reform and Consumer Protection Act of 2011, the Sarbanes-Oxley Act of 2002 and the Gramm-Leach-Bliley Act of 1999, and mergers and acquisitions.<\/p>\n\n\n\n<p>Forward-looking statements speak only as of the date they are made. The Company does not undertake to update forward-looking statements to reflect circumstances or events that occur after the date forward looking statements are made.<\/p>\n\n\n\n<p>&nbsp;####<\/p>\n\n\n\n<p><strong>For additional information contact:<\/strong><br><br>Westamerica Bancorporation<br><strong>Robert A. Thorson<\/strong>, Senior Vice President and Treasurer, (707) 863-6840<br>E-mail:&nbsp;<a href=\"mailto:investments@westamerica.com\">investments@westamerica.com<\/a><\/p>\n","protected":false},"excerpt":{"rendered":"<p>SAN RAFAEL, CA: Westamerica Bancorporation (Nasdaq: WABC), parent company of Westamerica Bank, generated net income for the first quarter 2020 of $17.0 million and diluted earnings per common share (&#8220;EPS&#8221;) of $0.63. First quarter 2020 results include a provision for credit losses of $4.3 million, which reduced EPS $0.11, representing Management’s estimate of additional reserves &hellip;<\/p>\n<p class=\"read-more\"> <a class=\"\" href=\"https:\/\/www.westamerica.com\/westamerica-bancorporation-reports-first-quarter-2020-financial-results\/\"> <span class=\"screen-reader-text\">Westamerica Bancorporation Reports First Quarter 2020 Financial Results<\/span> Read More &raquo;<\/a><\/p>\n","protected":false},"author":3,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/www.westamerica.com\/wp-json\/wp\/v2\/posts\/4515"}],"collection":[{"href":"https:\/\/www.westamerica.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.westamerica.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.westamerica.com\/wp-json\/wp\/v2\/users\/3"}],"replies":[{"embeddable":true,"href":"https:\/\/www.westamerica.com\/wp-json\/wp\/v2\/comments?post=4515"}],"version-history":[{"count":2,"href":"https:\/\/www.westamerica.com\/wp-json\/wp\/v2\/posts\/4515\/revisions"}],"predecessor-version":[{"id":4517,"href":"https:\/\/www.westamerica.com\/wp-json\/wp\/v2\/posts\/4515\/revisions\/4517"}],"wp:attachment":[{"href":"https:\/\/www.westamerica.com\/wp-json\/wp\/v2\/media?parent=4515"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.westamerica.com\/wp-json\/wp\/v2\/categories?post=4515"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.westamerica.com\/wp-json\/wp\/v2\/tags?post=4515"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}