{"id":4802,"date":"2020-07-16T17:19:50","date_gmt":"2020-07-16T17:19:50","guid":{"rendered":"https:\/\/www.westamerica.com\/?p=4802"},"modified":"2020-10-15T17:19:34","modified_gmt":"2020-10-15T17:19:34","slug":"westamerica-bancorporation-reports-second-quarter-2020-financial-results","status":"publish","type":"post","link":"https:\/\/www.westamerica.com\/westamerica-bancorporation-reports-second-quarter-2020-financial-results\/","title":{"rendered":"Westamerica Bancorporation Reports Second Quarter 2020 Financial Results"},"content":{"rendered":"\n<p>SAN RAFAEL, CA: Westamerica Bancorporation (<a rel=\"noreferrer noopener\" href=\"http:\/\/quotes.nasdaq.com\/Quote.dll?page=multi&amp;mode=stock&amp;mode=Stock&amp;symbol=WABC%00\" target=\"_blank\">Nasdaq: WABC<\/a>), parent company of Westamerica Bank, generated net income for the second quarter 2020 of $19.6 million and diluted earnings per common share (&#8220;EPS&#8221;) of $0.72. These results compare to net income of $17.0 million and EPS of $0.63 for the first quarter 2020 and net income of $19.6 million and EPS of $0.73 for the second quarter 2019.<\/p>\n\n\n\n<p>&#8220;Westamerica’s primary\nobjective during the Covid-19 pandemic is to support our customers. Westamerica\nremains open for business during regular business hours at all but one branch.\nWestamerica funded $249 million Paycheck Protection Program loans for our\ncustomers during the second quarter 2020. We are following all health orders\naffecting our business to keep our customers and employees safe. Westamerica’s net\ninterest income on a fully-tax equivalent basis for the second quarter 2020 increased\nto $42.1 million from $40.5 million for the first quarter 2020. Operating\nexpenses were $24.8 million for the second quarter 2020, representing only 48\npercent of revenues on a fully-taxable equivalent basis. Credit quality\nremained stable with nonperforming assets of $4.6 million at June 30, 2020,” said\nChairman, President and CEO David Payne. “Second quarter 2020 results generated\nan annualized 11.1 percent return on average common equity, and shareholders\nwere paid a $0.41 per common share dividend during the quarter” concluded\nPayne.<\/p>\n\n\n\n<p>Net interest income on a\nfully-taxable equivalent (FTE) basis was $42.1 million for the second quarter\n2020, compared to $40.5 million for the first quarter 2020 and $40.3 million\nfor the second quarter 2019. The annualized net interest margin (FTE) was 2.99 percent\nfor the second quarter 2020, compared to 3.10 percent for the first quarter 2020\nand 3.13 percent for the second quarter 2019. The decline in the margin during\nthe second quarter 2020 is primarily due to higher average interest-bearing\ncash balances and lower cash yields. Total average deposits grew $371 million\nduring the second quarter 2020. Checking and savings deposits represented\nninety-seven percent of the Company’s average deposit base during the second\nquarter 2020 maintaining a 0.03 percent annualized cost of funding\ninterest-earning assets.<\/p>\n\n\n\n<p>The Company has been actively\nworking with consumer and commercial borrowers requesting deferral of loan\npayments. At June 30, 2020, automobile loans and other consumer loans granted\nloan deferrals totaled $29 million and $5 million, respectively, commercial real\nestate loans with deferred payments totaled $66 million, primarily for\nhospitality and retail properties, and commercial loans with deferred payments\ntotaled $3 million. The commercial real estate loans with deferred payments are\nseasoned with low loan-to-value ratios.<\/p>\n\n\n\n<p>Nonperforming assets were\n$4.6 million at June 30, 2020. The Company’s allowance for credit losses was $25\nmillion at June 30, 2020. The Company recognized no provision for credit losses\nin the second quarter 2020 compared to a Covid-19 related provision of $4.3\nmillion for the first quarter 2020.<\/p>\n\n\n\n<p>Noninterest income for the\nsecond quarter 2020 totaled $9.6 million, compared to $11.6 million for the first\nquarter 2020, and $12.3 million for the second quarter 2019. Beginning March\n2020, activity-based fees related to deposit accounts and merchant processing\nfees have been lower due to reduced economic activity.<\/p>\n\n\n\n<p>Noninterest expense for\nthe second quarter 2020 was $24.8 million compared to $24.7 million for the first\nquarter 2020 and $25.6 million for the second quarter 2019.<\/p>\n\n\n\n<p>Westamerica Bancorporation’s wholly owned subsidiary Westamerica Bank, operates commercial banking and trust offices throughout Northern and Central California.<\/p>\n\n\n\n<p><a aria-label=\" (opens in a new tab)\" href=\"\/wp-content\/uploads\/2020\/07\/Q2-20-Financial-Highlights.pdf\" target=\"_blank\" rel=\"noreferrer noopener\">Quarterly Financial Highlights<\/a><\/p>\n\n\n\n<p>FORWARD-LOOKING INFORMATION:<\/p>\n\n\n\n<p>The following appears in accordance with the Private Securities Litigation Reform Act of 1995:<\/p>\n\n\n\n<p>This press release may contain forward-looking statements about the Company, including descriptions of plans or objectives of its management for future operations, products or services, and forecasts of its revenues, earnings or other measures of economic performance. Forward-looking statements can be identified by the fact that they do not relate strictly to historical or current facts. They often include the words “believe,” “expect,” “anticipate,” “intend,” “plan,” “estimate,” or words of similar meaning, or future or conditional verbs such as “will,” “would,” “should,” “could,” or “may.”<\/p>\n\n\n\n<p>Forward-looking statements, by their nature, are subject to risks and uncertainties. A number of factors — many of which are beyond the Company’s control — could cause actual conditions, events or results to differ significantly from those described in the forward-looking statements. The Company’s most recent reports filed with the Securities and Exchange Commission, including the annual report for the year ended December 31, 2018 filed on Form 10-K and quarterly report for the quarter ended September 30, 2018 filed on Form 10-Q, describe some of these factors, including certain credit, interest rate, operational, liquidity and market risks associated with the Company’s business and operations. Other factors described in these reports include changes in business and economic conditions, competition, fiscal and monetary policies, disintermediation, cyber security risks, legislation including the Dodd-Frank Wall Street Reform and Consumer Protection Act of 2011, the Sarbanes-Oxley Act of 2002 and the Gramm-Leach-Bliley Act of 1999, and mergers and acquisitions.<\/p>\n\n\n\n<p>Forward-looking statements speak only as of the date they are made. The Company does not undertake to update forward-looking statements to reflect circumstances or events that occur after the date forward looking statements are made.<\/p>\n\n\n\n<p>The following appears in\naccordance with the Private Securities Litigation Reform Act of 1995:<\/p>\n\n\n\n<p>This press release may\ncontain forward-looking statements about the Company, including descriptions of\nplans or objectives of its management for future operations, products or\nservices, and forecasts of its revenues, earnings or other measures of economic\nperformance. Forward-looking statements can be identified by the fact that they\ndo not relate strictly to historical or current facts. They often include the\nwords &#8220;believe,&#8221; &#8220;expect,&#8221; &#8220;anticipate,&#8221;\n&#8220;intend,&#8221; &#8220;plan,&#8221; &#8220;estimate,&#8221; or words of similar\nmeaning, or future or conditional verbs such as &#8220;will,&#8221; &#8220;would,&#8221;\n&#8220;should,&#8221; &#8220;could,&#8221; or &#8220;may.&#8221;<\/p>\n\n\n\n<p>Forward-looking statements,\nby their nature, are subject to risks and uncertainties. A number of factors —\nmany of which are beyond the Company&#8217;s control — could cause actual conditions,\nevents or results to differ significantly from those described in the\nforward-looking statements. The Company&#8217;s most recent reports filed with the\nSecurities and Exchange Commission, including the annual report for the year\nended December 31, 2019 filed on Form 10-K and quarterly report for the quarter\nended March 31, 2020 filed on Form 10-Q, describe some of these factors,\nincluding certain credit, interest rate, operational, liquidity and market\nrisks associated with the Company&#8217;s business and operations. Other factors\ndescribed in these reports include changes in business and economic conditions,\ncompetition, fiscal and monetary policies, disintermediation, cyber security\nrisks, legislation including the Dodd-Frank Wall Street Reform and Consumer\nProtection Act of 2011, the Sarbanes-Oxley Act of 2002 and the Gramm-Leach-Bliley\nAct of 1999, and mergers and acquisitions.<\/p>\n\n\n\n<p>Forward-looking statements\nspeak only as of the date they are made. The Company does not undertake to\nupdate forward-looking statements to reflect circumstances or events that occur\nafter the date forward looking statements are made.<\/p>\n\n\n\n<p>Forward-looking statements speak only as of the date they are made. The Company does not undertake to update forward-looking statements to reflect circumstances or events that occur after the date forward looking statements are made.<\/p>\n\n\n\n<p>&nbsp;####<\/p>\n\n\n\n<p><strong>For additional information contact:<\/strong><br><br>Westamerica Bancorporation<br><strong>Robert A. Thorson<\/strong>, Senior Vice President and Treasurer, (707) 863-6840<br>E-mail:&nbsp;<a href=\"mailto:investments@westamerica.com\">investments@westamerica.com<\/a><\/p>\n","protected":false},"excerpt":{"rendered":"<p>SAN RAFAEL, CA: Westamerica Bancorporation (Nasdaq: WABC), parent company of Westamerica Bank, generated net income for the second quarter 2020 of $19.6 million and diluted earnings per common share (&#8220;EPS&#8221;) of $0.72. These results compare to net income of $17.0 million and EPS of $0.63 for the first quarter 2020 and net income of $19.6 &hellip;<\/p>\n<p class=\"read-more\"> <a class=\"\" href=\"https:\/\/www.westamerica.com\/westamerica-bancorporation-reports-second-quarter-2020-financial-results\/\"> <span class=\"screen-reader-text\">Westamerica Bancorporation Reports Second Quarter 2020 Financial Results<\/span> Read More &raquo;<\/a><\/p>\n","protected":false},"author":3,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/www.westamerica.com\/wp-json\/wp\/v2\/posts\/4802"}],"collection":[{"href":"https:\/\/www.westamerica.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.westamerica.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.westamerica.com\/wp-json\/wp\/v2\/users\/3"}],"replies":[{"embeddable":true,"href":"https:\/\/www.westamerica.com\/wp-json\/wp\/v2\/comments?post=4802"}],"version-history":[{"count":2,"href":"https:\/\/www.westamerica.com\/wp-json\/wp\/v2\/posts\/4802\/revisions"}],"predecessor-version":[{"id":4993,"href":"https:\/\/www.westamerica.com\/wp-json\/wp\/v2\/posts\/4802\/revisions\/4993"}],"wp:attachment":[{"href":"https:\/\/www.westamerica.com\/wp-json\/wp\/v2\/media?parent=4802"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.westamerica.com\/wp-json\/wp\/v2\/categories?post=4802"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.westamerica.com\/wp-json\/wp\/v2\/tags?post=4802"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}