{"id":5483,"date":"2021-04-15T15:56:41","date_gmt":"2021-04-15T15:56:41","guid":{"rendered":"https:\/\/www.westamerica.com\/?p=5483"},"modified":"2021-04-15T15:56:41","modified_gmt":"2021-04-15T15:56:41","slug":"westamerica-bancorporation-reports-first-quarter-2021-financial-results","status":"publish","type":"post","link":"https:\/\/www.westamerica.com\/westamerica-bancorporation-reports-first-quarter-2021-financial-results\/","title":{"rendered":"Westamerica Bancorporation Reports First Quarter 2021 Financial Results"},"content":{"rendered":"\n<p>SAN RAFAEL, CA: Westamerica Bancorporation (Nasdaq: WABC), parent company of Westamerica Bank, generated net income for the first quarter 2021 of $20.1 million and diluted earnings per common share (&#8220;EPS&#8221;) of $0.75. First quarter 2021 results include “make-whole” interest income on corporate bonds redeemed prior to maturity, which increased EPS $0.02. These results compare to net income of $23.8 million and EPS of $0.89 for the fourth quarter 2020, which included a gain on sale of a closed branch building, “make-whole” interest income on corporate bonds redeemed before maturity, and a customary adjustment to the tax provision for filed 2019 tax returns, which increased EPS $0.15.<\/p>\n\n\n\n<p>&#8220;Westamerica continues to support our customers during the pandemic. We have kept our branches open to continue providing full-service, and during the first quarter 2021, we originated $91 million in loans under the second round of the Paycheck Protection Program. Operating expenses have remained stable with first quarter 2020 pre-pandemic levels, and in the first quarter 2021 operating expenses represented only 47 percent of revenues on a fully-taxable equivalent basis. The predominance of checking and savings accounts within Westamerica’s deposit base resulted in a very low 0.03 percent annualized cost of funding our loan and bond portfolios during the first quarter 2021. Credit quality remained stable with nonperforming loans of $4.1 million at March 31, 2021,” said Chairman, President and CEO David Payne. “First quarter 2021 results generated an annualized 11.1 percent return on average common equity, and shareholders were paid a $0.41 per common share dividend during the quarter,” concluded Payne.<\/p>\n\n\n\n<p>Net interest income on a fully-taxable equivalent (FTE) basis was $42.6 million for the first quarter 2021, including “make-whole” interest income on corporate bonds redeemed prior to maturity of $700 thousand. First quarter 2021 net interest income (FTE) compares to $43.3 million for the fourth quarter 2020, which included “make-whole” interest income on corporate bonds redeemed prior to maturity of $1.9 million. Average total deposits grew $92 million from the fourth quarter 2020 to the first quarter 2021. Checking and savings deposits represented ninety-seven percent of the Company’s average deposit base during the first quarter 2021 resulting in a 0.03 percent annualized cost of funding interest-earning assets.<\/p>\n\n\n\n<p>At March 31, 2021, nonperforming loans totaled $4.1 million and the allowance for credit losses on loans was $23.5 million. The Company continues to work with loan customers requesting deferral of loan payments due to economic weakness caused by the pandemic. At March 31, 2021, loans with deferred payments included consumer loans totaling $1.8 million and one hospitality industry commercial real estate loan totaling $2.3 million (the commercial real estate loan borrower re-commenced payments on April 1, 2021).<\/p>\n\n\n\n<p>Noninterest income for the first quarter 2021 totaled $10.2 million, compared to noninterest income for the fourth quarter 2020 of $14.0 million, which included a $3.5 million gain on sale of a closed branch building.<\/p>\n\n\n\n<p>Noninterest expense for the first quarter 2021 was $24.9 million compared to $24.5 million for the fourth quarter 2020, and $24.7 million for the first quarter 2020.<\/p>\n\n\n\n<p>Westamerica Bancorporation’s wholly owned subsidiary Westamerica Bank, operates commercial banking and trust offices throughout Northern and Central California.<\/p>\n\n\n\n<p><a href=\"\/wp-content\/uploads\/2021\/04\/Q1-21-Financial-Highlights.pdf\" target=\"_blank\" rel=\"noreferrer noopener\">Quarterly Financial Highlights<\/a><\/p>\n\n\n\n<p>FORWARD-LOOKING INFORMATION:<\/p>\n\n\n\n<p>The following appears in accordance with the Private Securities Litigation Reform Act of 1995:<\/p>\n\n\n\n<p>This press release may contain forward-looking statements about the Company, including descriptions of plans or objectives of its management for future operations, products or services, and forecasts of its revenues, earnings or other measures of economic performance. Forward-looking statements can be identified by the fact that they do not relate strictly to historical or current facts. They often include the words &#8220;believe,&#8221; &#8220;expect,&#8221; &#8220;anticipate,&#8221; &#8220;intend,&#8221; &#8220;plan,&#8221; &#8220;estimate,&#8221; or words of similar meaning, or future or conditional verbs such as &#8220;will,&#8221; &#8220;would,&#8221; &#8220;should,&#8221; &#8220;could,&#8221; or &#8220;may.&#8221;<\/p>\n\n\n\n<p>Forward-looking statements, by their nature, are subject to risks and uncertainties. A number of factors — many of which are beyond the Company&#8217;s control — could cause actual conditions, events or results to differ significantly from those described in the forward-looking statements. The Company&#8217;s most recent reports filed with the Securities and Exchange Commission, including the annual report for the year ended December 31, 2020 filed on Form 10-K and quarterly report for the quarter ended September 30, 2020 filed on Form 10-Q, describe some of these factors, including certain credit, interest rate, operational, liquidity and market risks associated with the Company&#8217;s business and operations. Other factors described in these reports include changes in business and economic conditions, competition, fiscal and monetary policies, disintermediation, cyber security risks, legislation including the Dodd-Frank Wall Street Reform and Consumer Protection Act of 2011, the Sarbanes-Oxley Act of 2002 and the Gramm-Leach-Bliley Act of 1999, and mergers and acquisitions.<\/p>\n\n\n\n<p>Forward-looking statements speak only as of the date they are made. The Company does not undertake to update forward-looking statements to reflect circumstances or events that occur after the date forward-looking statements are made.<\/p>\n\n\n\n<p>####<\/p>\n\n\n\n<p><strong>For additional information contact:<\/strong><br><br>Westamerica Bancorporation<br><strong>Robert A. Thorson<\/strong>, Senior Vice President and Treasurer, (707) 863-6840<br>E-mail:&nbsp;<a href=\"mailto:investments@westamerica.com\">investments@westamerica.com<\/a><\/p>\n","protected":false},"excerpt":{"rendered":"<p>SAN RAFAEL, CA: Westamerica Bancorporation (Nasdaq: WABC), parent company of Westamerica Bank, generated net income for the first quarter 2021 of $20.1 million and diluted earnings per common share (&#8220;EPS&#8221;) of $0.75. First quarter 2021 results include “make-whole” interest income on corporate bonds redeemed prior to maturity, which increased EPS $0.02. These results compare to &hellip;<\/p>\n<p class=\"read-more\"> <a class=\"\" href=\"https:\/\/www.westamerica.com\/westamerica-bancorporation-reports-first-quarter-2021-financial-results\/\"> <span class=\"screen-reader-text\">Westamerica Bancorporation Reports First Quarter 2021 Financial Results<\/span> Read More &raquo;<\/a><\/p>\n","protected":false},"author":3,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/www.westamerica.com\/wp-json\/wp\/v2\/posts\/5483"}],"collection":[{"href":"https:\/\/www.westamerica.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.westamerica.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.westamerica.com\/wp-json\/wp\/v2\/users\/3"}],"replies":[{"embeddable":true,"href":"https:\/\/www.westamerica.com\/wp-json\/wp\/v2\/comments?post=5483"}],"version-history":[{"count":1,"href":"https:\/\/www.westamerica.com\/wp-json\/wp\/v2\/posts\/5483\/revisions"}],"predecessor-version":[{"id":5484,"href":"https:\/\/www.westamerica.com\/wp-json\/wp\/v2\/posts\/5483\/revisions\/5484"}],"wp:attachment":[{"href":"https:\/\/www.westamerica.com\/wp-json\/wp\/v2\/media?parent=5483"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.westamerica.com\/wp-json\/wp\/v2\/categories?post=5483"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.westamerica.com\/wp-json\/wp\/v2\/tags?post=5483"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}