{"id":1229,"date":"2019-01-23T21:19:47","date_gmt":"2019-01-23T21:19:47","guid":{"rendered":"http:\/\/dev.westamerica.com\/?page_id=1229"},"modified":"2021-01-22T16:12:49","modified_gmt":"2021-01-22T16:12:49","slug":"overdraft-services","status":"publish","type":"page","link":"https:\/\/www.westamerica.com\/business\/checking\/overdraft-services\/","title":{"rendered":"Overdraft Services"},"content":{"rendered":"<h2>Business Checking<\/h2>\n<p><span style=\"width: 100%;\"><img alt=\"Business Checking\" width=\"877\" height=\"155\" title=\"BUSINESS_CHECKING\" data-id=\"5300\" src=\"https:\/\/www.westamerica.com\/wp-content\/uploads\/2021\/01\/BUSINESS_CHECKING.png\" style=\"\" scale=\"0\" data-width=\"877\" data-height=\"155\" data-init-width=\"850\" data-init-height=\"150\" loading=\"lazy\"><\/span><\/p>\n<h1>Overdraft Services<\/h1>\n<p>Responsible account management is important and diligently monitoring your business’s checking account activity will allow you to keep track of the balance, identify unauthorized activity, and help you to avoid overdrawing the account. You should make every effort to avoid overdrawing the account since our resulting fees and charges can be very expensive. By not overdrawing the account, you can avoid these fees. The Bank offers Linked Overdraft Protection, which may be less costly and help you avoid overdrafts.<\/p>\n<h4>What is an overdraft?<\/h4>\n<p>An overdraft occurs when you do not have enough money in your account to cover a transaction, but the Bank processes and pays the transaction.<\/p>\n<h4>How do overdrafts occur?<\/h4>\n<p>Overdrafts can happen due to a number of circumstances, such as:<\/p>\n<ul>\n<li>The payment of checks, debit card purchases, ATM transactions, automatic bill payments and electronic transfers where funds are not available to cover the entire amount of the transaction<\/li>\n<li>Deposits which, according to our funds availability policy, are treated as not yet available or finally paid<\/li>\n<li>Deposited items that are returned unpaid<\/li>\n<\/ul>\n<h4>What is Expanded Overdraft Services?<\/h4>\n<p>Expanded Overdraft Service is a form of overdraft coverage that we use at our discretion to pay transactions when you do not have sufficient funds in your account. After your account has been opened, your business account is automatically enrolled in our Expanded Overdraft Service and an Overdraft Service limit will be assigned to your account. The amount of the Overdraft Service limit assigned to your account can change (go up or down) at any time. The amount is based on several factors including your account history and deposit activity and patterns. Under our Expanded Overdraft Service, we may at our discretion cover overdrafts resulting from your checks, ACH transactions (including automatic bill payments), other transactions made using your checking account number and also ATM transactions and everyday debit card transactions. We will charge your account a $35 Overdraft Fee for each ATM transaction or everyday debit card transaction that we pay that overdraws your account, as well as for each check, ACH transaction (including automatic bill payments), and other transactions made using your checking account number that we pay that overdraws your account (maximum of 10 or $350 per day). You can choose not to have Expanded Overdraft Service coverage at any time.<\/p>\n<h4>How does it work?<\/h4>\n<p>With Expanded Overdraft Service, we may choose (but are not obligated) to cover overdrafts on your account. This is a discretionary service, which means we have the right to refuse to pay any transaction that would overdraw your account.<\/p>\n<h4>Are there fees?<\/h4>\n<p>Yes, we charge a $35 Overdraft Fee for each transaction that overdraws your account, up to $350 per day (which equals 10 Overdraft Fees). We do not charge the $35 Overdraft Fee for any item which overdraws your account by $2 or less (for non-analyzed accounts).&nbsp;<\/p>\n<h4>Opting Out: Can I choose not to have any Overdraft Service?<\/h4>\n<p>Yes. If you do not want us to pay any items that will cause an overdraft on your account, you may choose to have no Overdraft Service coverage. If you opt out of Overdraft Service coverage, we will return checks, ACH transactions (including automatic bill payments), and other transactions made using your checking account number that would overdraw your account (unless you have Linked Overdraft Protection). We charge a $35 Insufficient Funds Fee for returning these types of transactions (maximum of 10 or $350 per day). Your ATM or everyday debit card transactions that would cause an overdraft will be declined, and we do NOT charge a fee if this happens. If you wish to cancel your overdraft service, you may do so at any time by visiting your local branch, calling (800) 848-1088, or notify us in writing at Westamerica Bank, Direct Data Entry, B-2X, P.O. Box 1200, Suisun City, CA 94585-1200.<\/p>\n<h4>How can I avoid overdraft fees?<\/h4>\n<p>The best way to avoid overdrafts is to manage your account responsibly and not become overdrawn.<\/p>\n<h4>Here are some tips to help you avoid overdrafts.<\/h4>\n<p><strong>Record all transactions<\/strong>A check register is a valuable tool. Keep an accurate and current record of all account transactions, which may include checks, debit card purchases and upcoming automatic payments. This will help you identify outstanding transactions that the Bank may have not yet received.&nbsp;<strong>Be aware of the available balance<\/strong>You can access the account balance online, via an ATM or by calling us at (800) 848-1088. Keep in mind that the account balance is continually changing and may not reflect outstanding transactions. <strong>Don’t “play the float” and don’t spend more than what is in the account<\/strong>When you write a check and give it to a third party, record the check immediately and consider the money unavailable for anything else. It is difficult to predict when it will be presented to us for payment by the payee. Guessing the length of time before a check clears and using those available funds for something else (“playing the float”) could cause costly overdrafts if the check is presented to us for payment sooner than you anticipate.&nbsp;<strong>Keep extra money in the account<\/strong>Extra money in the checking account provides a safety net, which could keep the account from becoming overdrawn.&nbsp;<strong>Consider Linked Overdraft Protection<\/strong>We offer Linked Overdraft Protection, which may be less costly and may help you avoid overdrafts. You may link your business checking account to another Westamerica Bank account, such as a savings account or credit line account, and if the checking account becomes overdrawn or the available balance falls below $1.00, available funds will be automatically transferred from the linked account.<\/p>\n<h4>Can I have Linked Overdraft Protection and Expanded Overdraft Service?<\/h4>\n<p>Yes. In addition to our Expanded Overdraft Service, you may also have Linked Overdraft Protection.<\/p>\n<h4>Where can I go for more information?<\/h4>\n<p>If you have any questions, or want more information about our Overdraft Services or Linked Overdraft Protection, stop by your local branch or call us at (800) 848-1088.<\/p>\n<p><strong>related resources<\/strong><\/p>\n<ul>\n<li><span><a href=\"\/wp-content\/uploads\/2019\/02\/ADV044-Business-Overdraft-Disclosure.pdf\" target=\"_blank\" rel=\"noopener\">Overdraft Disclosure for Business Accounts<\/a><\/span><\/li>\n<\/ul>\n<ul>\n<li><span><a href=\"\/business\/preventing-business-losses\/\">Preventing Business Losses<\/a><\/span><\/li>\n<\/ul>\n","protected":false},"excerpt":{"rendered":"<p>Business Checking Overdraft Services Responsible account management is important and diligently monitoring your business’s checking account activity will allow you to keep track of the balance, identify unauthorized activity, and help you to avoid overdrawing the account. You should make every effort to avoid overdrawing the account since our resulting fees and charges can be &hellip;<\/p>\n<p class=\"read-more\"> <a class=\"\" href=\"https:\/\/www.westamerica.com\/business\/checking\/overdraft-services\/\"> <span class=\"screen-reader-text\">Overdraft Services<\/span> Read More &raquo;<\/a><\/p>\n","protected":false},"author":3,"featured_media":0,"parent":436,"menu_order":21,"comment_status":"closed","ping_status":"closed","template":"","meta":[],"_links":{"self":[{"href":"https:\/\/www.westamerica.com\/wp-json\/wp\/v2\/pages\/1229"}],"collection":[{"href":"https:\/\/www.westamerica.com\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/www.westamerica.com\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/www.westamerica.com\/wp-json\/wp\/v2\/users\/3"}],"replies":[{"embeddable":true,"href":"https:\/\/www.westamerica.com\/wp-json\/wp\/v2\/comments?post=1229"}],"version-history":[{"count":42,"href":"https:\/\/www.westamerica.com\/wp-json\/wp\/v2\/pages\/1229\/revisions"}],"predecessor-version":[{"id":5325,"href":"https:\/\/www.westamerica.com\/wp-json\/wp\/v2\/pages\/1229\/revisions\/5325"}],"up":[{"embeddable":true,"href":"https:\/\/www.westamerica.com\/wp-json\/wp\/v2\/pages\/436"}],"wp:attachment":[{"href":"https:\/\/www.westamerica.com\/wp-json\/wp\/v2\/media?parent=1229"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}