{"id":1312,"date":"2019-01-29T17:12:04","date_gmt":"2019-01-29T17:12:04","guid":{"rendered":"http:\/\/dev.westamerica.com\/business\/online-banking\/starconnect-plus\/purchase-rewards-faqs\/"},"modified":"2021-01-22T16:48:28","modified_gmt":"2021-01-22T16:48:28","slug":"purchase-rewards-faqs","status":"publish","type":"page","link":"https:\/\/www.westamerica.com\/business\/online-banking\/starconnect-plus\/purchase-rewards-faqs\/","title":{"rendered":"Purchase Rewards FAQs"},"content":{"rendered":"<h2>StarConnect Plus<\/h2>\n<p><span style=\"width: 100%;\"><img alt=\"Business Online Banking\" width=\"877\" height=\"155\" title=\"BUSINESS_ONLINE_BANKING\" data-id=\"5302\" src=\"https:\/\/www.westamerica.com\/wp-content\/uploads\/2021\/01\/BUSINESS_ONLINE_BANKING.png\" style=\"\" scale=\"0\" data-width=\"877\" data-height=\"155\" data-init-width=\"850\" data-init-height=\"150\" loading=\"lazy\"><\/span><\/p>\n<h1>Purchase Rewards FAQs<\/h1>\n<h4>What are Purchase Rewards?<\/h4>\n<p>You can earn rewards by using your Westamerica ATM\/Debit card to purchase merchandise and services. You&#8217;ll receive targeted offers to receive rewards on purchases based on how you shop. There is no limit to the rewards you can earn. So, the more you use your ATM\/Debit card, the more offers you can receive and the more rewards you can earn!<\/p>\n<h4>Can I use any of my Westamerica cards to earn rewards?<\/h4>\n<p>You have to use your Westamerica ATM\/Debit card that is associated with the account that received the offer to earn rewards.<\/p>\n<h4>Where do I go to see offers?<\/h4>\n<p>You can find offers on the home page beneath transactions in the transaction history or in the &#8220;rewards&#8221; section in the upper right part of the page. Offers can also be found on the account history page or the rewards summary page. New offers will be labeled as &#8220;New Offers&#8221; until you click to activate them. Once clicked, the reward is &#8220;loaded onto&#8221; the associated debit card. All offers can be viewed by visiting the rewards summary page.<\/p>\n<h4>How do I redeem offers?<\/h4>\n<p>To redeem an offer, simply click on link to see the details; this automatically loads the offer onto your debit card. Then shop at the specified retailer and pay using your debit card to earn the reward. Each offer has different details regarding when and where to shop and how much you need to spend. Offers that require an online purchase are clearly specified and may include a redemption code. Please read the details to determine how to redeem each offer and start earning rewards.<\/p>\n<h4>Do I need to use a coupon or code to earn rewards?<\/h4>\n<p>Typically, you do not need a coupon or code to redeem an offer. Each offer has different specifications regarding when and where you shop and how much you need to spend. Offers that require an online purchase are clearly specified and may include a redemption code. Please read offer details to determine how to redeem each offer.<\/p>\n<h4>How long do I have to take advantage of an offer?<\/h4>\n<p>Each offer has an offer period that was set by the merchant. You must redeem offers before the expiration date. The expiration date can be found in the offer details section of the offer by clicking on the offer.<\/p>\n<h4>When do I receive the rewards for the offers I redeem?<\/h4>\n<p>Your rewards will typically be deposited to your account the month after you redeem the offer. For example, any rewards you redeem in the month of September typically will be credited to your account during the month of October. If you would like to see the offers you have redeemed or the total value of the offers you have redeemed, please visit the rewards summary page.<\/p>\n<h4>Why don&#8217;t I have any offers?<\/h4>\n<p>Offers are based on how you currently shop to ensure the offers you receive are relevant. If you seldom use your debit card, you may not receive any offers until you begin using your card more. The more you use your Wesetamerica ATM\/Debit card, the more chances you will have to receive relevant offers!Additionally, you may not be receiving any offers because you may have accidentally opted out of the program. If you cannot access the rewards summary page or don&#8217;t see the &#8220;rewards&#8221; section in the upper right part of the new home page, you are not enrolled in the rewards program. Please call Electronic Services at (800) 829-8629 to be opted back in.<\/p>\n<h4>What if I do not want to receive offers?<\/h4>\n<p>You can opt out by clicking on the &#8220;Stop receiving all offers&#8221; link on the rewards summary page. This link can be found in the upper right part of the rewards summary page. If you opt out of the rewards program at this time but change your mind later, please contact Electronic Services at (800) 829-8629 and we will resume providing offers to you.<\/p>\n<h4>Is my personal information shared with retailers?<\/h4>\n<p>No. Your personal information is not shared with retailers. In fact, no personal information leaves your financial institution.<\/p>\n<h4>Is this program free?<\/h4>\n<p>Yes, this program is free! There is no cost associated with this program, making it easy for you to earn rewards. Purchase Rewards is another benefit of using your Westamerica ATM\/Debit card.<\/p>\n<h4>Who do I call if I have a question?<\/h4>\n<p>You can contact Electronic Services at (800) 829-8629 if you have any questions.<\/p>\n<p><strong>online banking<\/strong><\/p>\n<ul>\n<li><span><a href=\"\/personal\/online-banking\">Personal Banking<\/a><\/span><\/li>\n<li><span><a href=\"\/business\/online-banking\">Business Banking<\/a><\/span><\/li>\n<\/ul>\n<p><strong>related resources<\/strong><\/p>\n<ul>\n<li><span><a href=\"\/business\/online-banking\/mobile-banking\/mobile-tips\/\">Mobile Tips<\/a><\/span><\/li>\n<li><span><a href=\"\/business\/preventing-business-losses\/\">Preventing Business Losses<\/a><\/span><\/li>\n<\/ul>\n","protected":false},"excerpt":{"rendered":"<p>StarConnect Plus Purchase Rewards FAQs What are Purchase Rewards? You can earn rewards by using your Westamerica ATM\/Debit card to purchase merchandise and services. You&#8217;ll receive targeted offers to receive rewards on purchases based on how you shop. There is no limit to the rewards you can earn. So, the more you use your ATM\/Debit &hellip;<\/p>\n<p class=\"read-more\"> <a class=\"\" href=\"https:\/\/www.westamerica.com\/business\/online-banking\/starconnect-plus\/purchase-rewards-faqs\/\"> <span class=\"screen-reader-text\">Purchase Rewards FAQs<\/span> Read More &raquo;<\/a><\/p>\n","protected":false},"author":3,"featured_media":0,"parent":1248,"menu_order":7,"comment_status":"closed","ping_status":"closed","template":"","meta":[],"_links":{"self":[{"href":"https:\/\/www.westamerica.com\/wp-json\/wp\/v2\/pages\/1312"}],"collection":[{"href":"https:\/\/www.westamerica.com\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/www.westamerica.com\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/www.westamerica.com\/wp-json\/wp\/v2\/users\/3"}],"replies":[{"embeddable":true,"href":"https:\/\/www.westamerica.com\/wp-json\/wp\/v2\/comments?post=1312"}],"version-history":[{"count":46,"href":"https:\/\/www.westamerica.com\/wp-json\/wp\/v2\/pages\/1312\/revisions"}],"predecessor-version":[{"id":5378,"href":"https:\/\/www.westamerica.com\/wp-json\/wp\/v2\/pages\/1312\/revisions\/5378"}],"up":[{"embeddable":true,"href":"https:\/\/www.westamerica.com\/wp-json\/wp\/v2\/pages\/1248"}],"wp:attachment":[{"href":"https:\/\/www.westamerica.com\/wp-json\/wp\/v2\/media?parent=1312"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}