{"id":1367,"date":"2019-01-29T19:17:15","date_gmt":"2019-01-29T19:17:15","guid":{"rendered":"http:\/\/dev.westamerica.com\/business\/online-banking\/starconnect-plus\/starconnect-plus-faqs\/"},"modified":"2021-01-22T16:48:17","modified_gmt":"2021-01-22T16:48:17","slug":"starconnect-plus-faqs","status":"publish","type":"page","link":"https:\/\/www.westamerica.com\/business\/online-banking\/starconnect-plus\/starconnect-plus-faqs\/","title":{"rendered":"StarConnect Plus FAQs"},"content":{"rendered":"<h2>StarConnect Plus<\/h2>\n<p><span style=\"width: 100%;\"><img alt=\"Business Online Banking\" width=\"877\" height=\"155\" title=\"BUSINESS_ONLINE_BANKING\" data-id=\"5302\" src=\"https:\/\/www.westamerica.com\/wp-content\/uploads\/2021\/01\/BUSINESS_ONLINE_BANKING.png\" style=\"\" scale=\"0\" data-lazy-loaded=\"1\" data-width=\"877\" data-height=\"155\" data-init-width=\"850\" data-init-height=\"150\" loading=\"lazy\">[tcb-noscript]<img alt=\"Business Online Banking\" width=\"877\" height=\"155\" title=\"BUSINESS_ONLINE_BANKING\" data-id=\"5302\" src=\"https:\/\/www.westamerica.com\/wp-content\/uploads\/2021\/01\/BUSINESS_ONLINE_BANKING.png\" style=\"\" scale=\"0\" data-lazy-src=\"\/wp-content\/uploads\/2019\/01\/banner-business-850.jpg?is-pending-load=1\" data-width=\"877\" data-height=\"155\" data-init-width=\"850\" data-init-height=\"150\" loading=\"lazy\"><img loading=\"lazy\" alt=\"\" width=\"850\" height=\"300\" title=\"banner-business-850\" data-id=\"997\" src=\"\/wp-content\/uploads\/2019\/01\/banner-business-850.jpg\" style=\"width: 100%;\" scale=\"0\">[\/tcb-noscript]<\/span><\/p>\n<h1>StarConnect Plus™ FAQs<\/h1>\n<h4>Which accounts can I access with StarConnect Plus?<\/h4>\n<p>Personal and business deposit accounts and loans may be linked to StarConnect Plus. A minimum of one checking or savings account must be linked to receive the service. For businesses with more complex cash management needs, we are pleased to offer Onsite Banker Plus;&nbsp;<a href=\"\/business\/online-banking\/onsite-banker-plus\/\">click here for more information.<\/a><\/p>\n<h4>What kind of functions can I perform with StarConnect Plus?<\/h4>\n<p>With StarConnect Plus online banking you can check your account balances; view checking and savings account histories; transfer funds between your accounts; make loan payments; request check copies and stop payments, and more. Download the mobile app to your device to deposit checks anywhere at any time. With our optional Bill Pay service, you can pay recurring or one-time bills in the amounts and on the dates you request and even receive bills via e-mail. We also offer a Direct Connect interface which allows you to export transaction information to Quicken<sup>®<\/sup>&nbsp;and QuickBooks<sup>®<\/sup>.<\/p>\n<h4>How do I register for StarConnect Plus?<\/h4>\n<p><a href=\"\/login\/\" style=\"outline: none; display: inline-block;\">Click here to sign up for a Basic Service<\/a>&nbsp;, then select the “Individual Registration” or “Business Registration” link. Individuals may complete the online registration form and submit it electronically. Partnerships, corporations, and sole proprietors must print a Registration Form, complete it, and return it to the branch in person or mail it to us. We will confirm your registration via e-mail.<\/p>\n<p>After your initial login, you can sign up for optional bill pay service by clicking on the Bill Pay icon on any StarConnect Plus page. Fees may apply.<\/p>\n<h4>Where can I get more information about using Bill Pay?<\/h4>\n<p>From the main navigation bar, select the Bill Pay icon, and then select &#8220;Get help&#8221; in the &#8220;I want to &#8230;&#8221; widget.<\/p>\n<h4>Can I download my transactions to Quicken® and QuickBooks®?<\/h4>\n<p>Yes, StarConnect Plus online banking users can download account information into Quicken&nbsp;and QuickBooks, giving you the power to organize your finances more effectively. After logging into StarConnect Plus, go to the Additional Services tab, and click the Connectivity to Quicken&nbsp;and QuickBooks&nbsp;link. Create your password on the Direct Connect Registration screen to begin using this service. The interface provides a streamlined way to download transactions and automatically reconcile them with your financial management system records. It minimizes the risk of exporting\/importing duplicate history and account data includes complete transaction and balance information. Your Quicken&nbsp;or QuickBooks, software will provide detailed information on how to download files. You are responsible for the purchase, set up, and maintenance of your chosen system. This feature is automatically included with StarConnect Plus at no extra charge.<\/p>\n<h4>What is a &#8216;Pending&#8217; transaction on my Account History?<\/h4>\n<p>Transactions that are shown with the word Pending in the Date column have been applied to your account after the start of the current business day.<\/p>\n<h4>What is the cut-off time for StarConnectPlus funds transfers?<\/h4>\n<p>The cut-off time for StarConnect Plus funds transfers, including transfers to a Westamerica Bank loan, is 6:00 p.m. Pacific Time. Transfers initiated after the cut-off time will be processed the next business day.<\/p>\n<h4>What is the cut-off time for StarConnectPlus bill payments?<\/h4>\n<p>The cut-off time for StarConnect Plus bill payments is 10:00 a.m. Pacific Time. A payment initiated after the cut-off will be considered to have been initiated on the next business day for the purpose of determining the default (earliest possible) Payment Date.<\/p>\n<h4>What does &#8216;Available Balance&#8217; mean?<\/h4>\n<p>The Available Balance is the actual ending balance of your account from the previous business day, less any funds being held, plus or minus any Pending transactions.<\/p>\n<h4>Why doesn&#8217;t my Credit Line appear in the &#8216;From Account&#8217; selection box for funds transfers?<\/h4>\n<p>A Credit Line will appear in the From Account selection box if the available credit is greater than $0. If your Credit Line has no funds available, the Line will not appear in the From Account selection box.<\/p>\n<h4>How do I get more information about my deposit account or loan?<\/h4>\n<p>From the transaction history page for the applicable account or loan, click on the &#8220;Account Details&#8221; drop down found under the account name. The information displayed varies by type of account.<\/p>\n<h4>What does the message &#8216;No history data was available for this date range&#8217; mean?<\/h4>\n<p>Why you may receive this message: 1) Checking and savings accounts: no transactions have posted during the specified date range. Try selecting another date range to view. 2) Certificates of Deposit, Individual Retirement Accounts (IRAs) and loans: Transaction history is not available for display on StarConnect Plus regardless of the date range specified.<\/p>\n<h4>Why does my loan display an amount of $99,999,999.99 in one or more places?<\/h4>\n<p>In some cases, certain types of monetary data are not available for display on StarConnect Plus; in these cases the system will instead display $99,999,999.99.<\/p>\n<h4>Why does my loan display a date of 00\/00\/0000?<\/h4>\n<p>In some cases, certain types of data are not available for StarConnect Plus to display; the system will instead display 00\/00\/0000.<\/p>\n<h4>What if my loan payment is past due?<\/h4>\n<p>If your loan payment is past due, the payment amounts and due dates may not display accurately. For the most accurate information about past due loan payments, please contact our Customer Service Department at (800) 848-1088.<\/p>\n<h4>How do I print information if there is no &#8216;Print&#8217; button on the page?<\/h4>\n<p>Select Print from your browser menu, or place your cursor within the window you want to print, click on the right-hand button on your mouse, and select Print from the menu that will appear.<\/p>\n<h4>How do I request a copy of a check?<\/h4>\n<p>From the main navigation bar, select Additional Services, then select Request Check Copies. Complete and submit the request.<\/p>\n<h4>How do I request a stop payment?<\/h4>\n<p>From the main navigation bar, select Additional Services, then Request Stop Payment. Complete and submit the form. Please note that if you wish to stop a StarConnect Plus bill payment that is in process or has completed processing, you must contact StarConnect Plus Customer Support at (800) 829-8629.<\/p>\n<h4>How do I add or delete accounts from my StarConnect Plus service?<\/h4>\n<p>From the main navigation bar, select Additional Services, then Add\/Delete Account. Complete and submit the form.<\/p>\n<h4>Can I change my Login ID?<\/h4>\n<p>Yes, when logged in, go to My Settings in the upper right corner, under Login &amp; Security click on “edit” next to <strong>Username<\/strong>, type the new username and use your current password, then click SAVE.<\/p>\n<h4>Can I change my password?<\/h4>\n<p>Yes, when logged in, go to My Settings in the upper right corner, under Login &amp; Security click on “edit” next to&nbsp;<strong>Username<\/strong>, type the new username and use your current password, then click SAVE.<\/p>\n<h4>Can I nickname my accounts?<\/h4>\n<p>From any StarConnect Plus banking page, select My Profile, My settings, under Other Settings click on Rename &amp; Hide Your Accounts, you will change the name of the account in the Nickname box next to the account you wish to make changes.<\/p>\n<h4>Can I hide accounts I do not wish to see?<\/h4>\n<p>Yes, when logged in StarConnect Plus, click on My settings, under Other Settings click on Rename &amp; Hide Your Accounts, under “Show Account” uncheck the box next to the account you select not to see. You can Unhide the accounts by checking the box under “Show Account” if you wish to see the account again.<\/p>\n<h4>Can I setup Balance Alerts and Notifications?<\/h4>\n<p>From any StarConnect Plus banking page, select My Profile then select Alerts and Notifications.<\/p>\n<h4>Is there a setting for promotional emails from the Bank?<\/h4>\n<p>Yes. From any StarConnect Plus banking page, select My Profile, then select User Options. Make your selection and submit the change. Please note that this setting affects only promotional e-mail messages sent through StarConnect Plus; non-promotional email messages (for example, notices or other communications about StarConnect Plus) and promotions or other communications delivered by U.S. Mail or by telephone will not be affected by this setting.<\/p>\n<h4>How do I protect myself from &#8216;phishing&#8217; scams?<\/h4>\n<p>&#8220;Phishing&#8221; refers to the process that cyber-criminals use to lure passwords and financial data in order to defraud users. They may send an e-mail message designed to appear as if it came from your financial institution or an Internet merchant, and\/or create a counterfeit web site that looks like a legitimate one. Replying to phishing e-mails, or using a link that may be embedded in a phishing email, puts your accounts at risk.Using the Internet to conduct business is still safe and convenient. Westamerica Bank will proactively keep customers informed of pertinent information as we become aware of it.What can you do to protect yourself?Westamerica Bank will never ask you for sensitive information via email (such as Social Security Number, Login ID, Password, Personal Identification Number, or account number). Do not trust or act upon unsolicited e-mails that request such information.<\/p>\n<p>To go to Westamerica’s website, type our web address, www.westamerica.com, into your browser and bookmark it (save as a favorite page); use the bookmark\/favorite derived from hand-typing our address for subsequent visits to our website. Never use a link embedded in an e-mail message to get to our website.<\/p>\n<p>Regularly access your browser’s website to download security patches, which may protect you against a variety of software vulnerabilities.<\/p>\n<p>Pay close attention to your bank statements and credit card statements. If you see anything unusual, immediately report it to your bank or card issuer.<\/p>\n<h4>What is Enhanced Login Security?<\/h4>\n<p>This superior security technology protects your accounts from unauthorized access. It identifies you as the true &#8220;owner&#8221; of your accounts by recognizing not only your password, but your computer as well. If we don&#8217;t recognize your computer &#8211; for example, if you log in from a public computer or one you haven&#8217;t used before- we&#8217;ll ask you for information that only you will know, as an additional line of defense to prevent unauthorized access. Enhanced Login Security protects you regardless of which computer you use, whether you&#8217;re at home or on the go.<\/p>\n<p><strong>online banking<\/strong><\/p>\n<ul>\n<li><span><a href=\"\/personal\/online-banking\">Personal Banking<\/a><\/span><\/li>\n<li><span><a href=\"\/business\/online-banking\">Business Banking<\/a><\/span><\/li>\n<\/ul>\n<p><strong>related resources<\/strong><\/p>\n<ul>\n<li><span><a href=\"\/business\/online-banking\/starconnect-plus\/purchase-rewards-faqs\/\">Purchase Rewards FAQs<\/a><\/span><\/li>\n<li><span><a href=\"\/business\/preventing-business-losses\/\">Preventing Business Losses<\/a><\/span><\/li>\n<\/ul>\n","protected":false},"excerpt":{"rendered":"<p>StarConnect Plus [tcb-noscript][\/tcb-noscript] StarConnect Plus™ FAQs Which accounts can I access with StarConnect Plus? Personal and business deposit accounts and loans may be linked to StarConnect Plus. A minimum of one checking or savings account must be linked to receive the service. For businesses with more complex cash management needs, we are pleased to offer &hellip;<\/p>\n<p class=\"read-more\"> <a class=\"\" href=\"https:\/\/www.westamerica.com\/business\/online-banking\/starconnect-plus\/starconnect-plus-faqs\/\"> <span class=\"screen-reader-text\">StarConnect Plus FAQs<\/span> Read More &raquo;<\/a><\/p>\n","protected":false},"author":3,"featured_media":0,"parent":1248,"menu_order":7,"comment_status":"closed","ping_status":"closed","template":"","meta":[],"_links":{"self":[{"href":"https:\/\/www.westamerica.com\/wp-json\/wp\/v2\/pages\/1367"}],"collection":[{"href":"https:\/\/www.westamerica.com\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/www.westamerica.com\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/www.westamerica.com\/wp-json\/wp\/v2\/users\/3"}],"replies":[{"embeddable":true,"href":"https:\/\/www.westamerica.com\/wp-json\/wp\/v2\/comments?post=1367"}],"version-history":[{"count":55,"href":"https:\/\/www.westamerica.com\/wp-json\/wp\/v2\/pages\/1367\/revisions"}],"predecessor-version":[{"id":5377,"href":"https:\/\/www.westamerica.com\/wp-json\/wp\/v2\/pages\/1367\/revisions\/5377"}],"up":[{"embeddable":true,"href":"https:\/\/www.westamerica.com\/wp-json\/wp\/v2\/pages\/1248"}],"wp:attachment":[{"href":"https:\/\/www.westamerica.com\/wp-json\/wp\/v2\/media?parent=1367"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}