{"id":1618,"date":"2019-01-30T21:50:36","date_gmt":"2019-01-30T21:50:36","guid":{"rendered":"http:\/\/dev.westamerica.com\/personal\/checking\/overdraft-services\/"},"modified":"2021-01-22T16:22:41","modified_gmt":"2021-01-22T16:22:41","slug":"overdraft-services","status":"publish","type":"page","link":"https:\/\/www.westamerica.com\/personal\/checking\/overdraft-services\/","title":{"rendered":"Overdraft Services"},"content":{"rendered":"<h2>Personal Checking<\/h2>\n<p><span style=\"width: 100%;\"><img alt=\"Personal Checking\" width=\"877\" height=\"155\" title=\"PERSONAL_CHECKING\" data-id=\"5305\" src=\"https:\/\/www.westamerica.com\/wp-content\/uploads\/2021\/01\/PERSONAL_CHECKING.png\" style=\"\" scale=\"0\" data-width=\"877\" data-height=\"155\" data-init-width=\"850\" data-init-height=\"150\" loading=\"lazy\"><\/span><\/p>\n<h1>Overdraft Services<\/h1>\n<h2>We are committed to serving you.<\/h2>\n<p>Every customer has unique financial needs, and at Westamerica, we provide options on how to manage your account based on your personal financial style. Responsible account management is important and diligently monitoring your checking account activity will allow you to keep track of your balance, identify unauthorized activity, and help you avoid overdrawing your account. You should make every effort to avoid overdrawing your account since our resulting fees and charges can be very expensive. By not overdrawing your account, you can avoid these fees.<\/p>\n<h2>Questions and Answers<\/h2>\n<h4>What is an overdraft?<\/h4>\n<p>An overdraft occurs when you do not have enough money in your account to cover a transaction, but the Bank processes and pays the transaction.<\/p>\n<h4>How do overdrafts occur?<\/h4>\n<p>Overdrafts can happen due to a number of circumstances, such as:<\/p>\n<ul>\n<li>The payment of checks, debit card purchases, ATM transactions, automatic bill payments and electronic transfers where funds are not available to cover the entire amount of the transaction<\/li>\n<li>Deposits which, according to our funds availability policy, are treated as not yet available or finally paid<\/li>\n<li>Deposited items that are returned unpaid<\/li>\n<\/ul>\n<h4>What are Overdraft Services?<\/h4>\n<p>Overdraft Services are a form of overdraft coverage that we use at our discretion to pay transactions when you do not have sufficient funds in your account. After your account has been opened, you may be eligible for this discretionary service. If you are, an Overdraft Service limit will be assigned to your account. The amount of the Overdraft Service limit assigned to your account can change (go up or down) at any time. The amount is based on several factors including your account history and deposit activity and patterns.<\/p>\n<h4>How does it work?<\/h4>\n<p>With Overdraft Service, we may choose (but are not obligated) to cover overdrafts on your account. This is a discretionary service, which means we have the right to refuse to pay any transaction that would overdraw your account.<\/p>\n<h4>Are there fees?<\/h4>\n<p>Yes, we charge a $35 Overdraft Fee for each transaction that overdraws your account, up to $210 per day (which equals 6 paid and\/or returned items). We do not charge the $35 Overdraft Fee for any item which overdraws your account by $5 or less.<\/p>\n<h4>What transactions are covered by Overdraft Services?<\/h4>\n<p>Our Overdraft Services are divided into two coverage options: Standard Overdraft Service and Expanded Overdraft Service, depending on the types of transactions for which you want overdraft coverage.<\/p>\n<h4>What is Standard Overdraft Service?<\/h4>\n<p>Upon account opening, you are automatically enrolled in our Standard Overdraft Service. Under our Standard Overdraft Service, we may at our discretion cover overdrafts resulting from your checks, ACH transactions (including automatic bill payments), and other transactions made using your checking account number. We charge your account a $35 Overdraft Fee for each of these transactions that overdraw your account, up to $210 per day. <strong>You can opt out of Standard Overdraft Service coverage anytime.<\/strong><\/p>\n<h4>What is Expanded Overdraft Service?<\/h4>\n<p>If you want to have your ATM transactions and everyday debit card transactions (such as a purchase you make at a merchant), covered in addition to what is covered under our Standard Overdraft Service then you must elect to opt in to our Expanded Overdraft Service.&nbsp;Under our Expanded Overdraft Service, we may at our discretion cover overdrafts resulting from your checks, ACH transactions (including automatic bill payments), other transactions made using your checking account number and also ATM transactions and everyday debit card transactions. If you opt in to Expanded Overdraft Service coverage, we will charge your account a $35 Overdraft Fee for each ATM transaction or everyday debit card transaction that we pay that overdraws your account, as well as for each check, ACH transaction (including automatic bill payments), and other transactions made using your checking account number that we pay that overdraws your account (maximum of 6 paid and\/or returned items or $210 per day).&nbsp;<strong>You can choose not to have Expanded Overdraft Service coverage at any time.<\/strong><\/p>\n<h4>Opting Out: Can I choose not to have any Overdraft Service?<\/h4>\n<p>Yes. If you do not want us to pay any items that will cause an overdraft on your account, you may choose to have no Overdraft Service coverage. If you opt out of Overdraft Service coverage, we will return checks, ACH transactions (including automatic bill payments), and other transactions made using your checking account number that would overdraw your account (unless you have Linked Overdraft Protection or&nbsp;<a href=\"\/personal\/loans-and-credit\/\" title=\"EXOD\">Extra Cash Overdraft Protection Line of Credit<\/a>). We charge a $35 Insufficient Funds Fee for returning these types of transactions (maximum of 6 paid and\/or returned items or $210 per day). Your ATM or everyday debit card transactions that would cause an overdraft will be declined, and we do NOT charge a fee if this happens.<\/p>\n<h4>How do I change the type of Overdraft Service I have?<\/h4>\n<p>If you wish to cancel or change your overdraft service type, you may do so at any time by visiting your local branch, calling (800) 848-1088, or notify us in writing at Westamerica Bank, Direct Data Entry, B-2X, P.O. Box 1200, Suisun City, CA 94585-1200.<\/p>\n<h4>How can I avoid overdraft fees?<\/h4>\n<p>The best way to avoid overdrafts is to manage your account responsibly and not become overdrawn.<\/p>\n<h4>Here are some tips to avoid overdrafts.<\/h4>\n<p><strong>Record all of your transactions<\/strong>A check register is a valuable tool. Keep an accurate and current record of all of your transactions, which may include checks, debit card purchases and upcoming automatic payments. This will help you to remember outstanding transactions that the Bank may have not yet received.&nbsp;<strong>Be aware of your available balance<\/strong>You can access your account balance online, via an ATM or by calling us at (800) 848-1088. Keep in mind that your account balance is continually changing and may not reflect outstanding transactions. <strong>Don’t “play the float” and don’t spend more than you have<\/strong>When you write a check and give it to a third party, record the check immediately and consider the money unavailable for anything else. It is difficult to predict when it will be presented to us for payment by the payee. Guessing the length of time before a check clears and using those available funds for something else (“playing the float”) could cause costly overdrafts if the check is presented to us for payment sooner than you anticipate.&nbsp;<strong>Keep extra money in your account<\/strong>Extra money in your checking account provides a safety net, which could keep you from becoming overdrawn.&nbsp;<strong>Establish Direct Deposit<\/strong>You may not always have time to go to the Bank, so set up direct deposit of your payroll, social security, retirement or pension to have your income conveniently deposited into your account.&nbsp;<strong>Consider Overdraft Protection<\/strong>We offer alternatives such as Linked Overdraft Protection and&nbsp;<a href=\"\/personal\/loans-and-credit\/\" title=\"EXOD\">Extra Cash Overdraft Protection Line of Credit<\/a>, that may be less costly and may help you avoid overdrafts. For example, you may have another Westamerica account linked to your checking account (Linked Overdraft Protection), or you can apply for an&nbsp;<a href=\"\/personal\/loans-and-credit\/\" title=\"EXOD\">Extra Cash Overdraft Protection Line of Credit<\/a>. For details about these services, visit your local branch, or call us at (800) 848-1088.<\/p>\n<h4>Can I have Linked Overdraft Protection, an Extra Cash Overdraft Protection Line of Credit, and Overdraft Services?<\/h4>\n<p>Yes. In addition to our Standard or Expanded Overdraft Service, you may also have Linked Overdraft Protection and\/or&nbsp;<a href=\"\/personal\/loans-and-credit\/\" title=\"EXOD\">Extra Cash Overdraft Protection Line of Credit<\/a>.<\/p>\n<h4>What are my options?<\/h4>\n<p><a href=\"\/personal\/checking\/overdraft-services\/overdraft-options\/\">Summary of Overdraft Fees and Overdraft Options<\/a><\/p>\n<h4>What will happen to my transaction if I don&#8217;t have enough money?<\/h4>\n<p><a href=\"\/personal\/checking\/overdraft-services\/overdraft-what-will-happen\/\">Overdraft Ex<span data-id=\"0\" data-type=\"false\" style=\"display: none; line-height: 0;\">​<\/span><span data-id=\"0\" data-type=\"true\" style=\"display: none; line-height: 0;\">​<\/span>amples<\/a><\/p>\n<h4>Where can I go for more information?<\/h4>\n<p>If you have any questions, or want more information about our Overdraft Services, Linked Overdraft Protection or Extra Cash Overdraft Protection Line of Credit, stop by your local branch, or call us at (800) 848-1088.<\/p>\n<h4>Additional Resources<\/h4>\n<p><a href=\"http:\/\/www.mymoney.gov\" target=\"_blank\" rel=\"noopener\">http:\/\/www.mymoney.gov<\/a> Sponsored by the U.S. government, this site teaches the basics of financial education and provides information to help you make smart financial decisions.&nbsp;<a href=\"http:\/\/www.aba.com\/consumers\" target=\"_blank\" rel=\"noopener\">http:\/\/www.aba.com\/consumers<\/a> The American Bankers Association Education Foundation offers consumer resources on topics such as finance management and fraud prevention.<a href=\"http:\/\/www.consumer.ftc.gov\" target=\"_blank\" rel=\"noopener\">http:\/\/www.consumer.ftc.gov<\/a> The Federal Trade Commission offers consumers practical information on a variety of topics to help you avoid fraud and exercise your consumer rights.<\/p>\n<p><strong>related resources<\/strong><\/p>\n<ul>\n<li><span><a href=\"\/wp-content\/uploads\/2019\/01\/ADV042-Consumer-Overdraft-Disclosure.pdf\" target=\"_blank\" rel=\"noopener\">Overdraft Disclosure for Consumer Accounts<\/a><\/span><\/li>\n<\/ul>\n<ul>\n<li><span>​<a href=\"\/wp-content\/uploads\/2019\/01\/ADV040-Overdraft-FAQs.pdf\" target=\"_blank\" rel=\"noopener\">Overdraft Services FAQs<\/a><\/span><\/li>\n<li><span>​<a href=\"\/wp-content\/uploads\/2019\/01\/MIS790.pdf\" target=\"_blank\" rel=\"noopener\">Overdraft Services Form<\/a><\/span><\/li>\n<\/ul>\n","protected":false},"excerpt":{"rendered":"<p>Personal Checking Overdraft Services We are committed to serving you. Every customer has unique financial needs, and at Westamerica, we provide options on how to manage your account based on your personal financial style. Responsible account management is important and diligently monitoring your checking account activity will allow you to keep track of your balance, &hellip;<\/p>\n<p class=\"read-more\"> <a class=\"\" href=\"https:\/\/www.westamerica.com\/personal\/checking\/overdraft-services\/\"> <span class=\"screen-reader-text\">Overdraft Services<\/span> Read More &raquo;<\/a><\/p>\n","protected":false},"author":3,"featured_media":0,"parent":458,"menu_order":7,"comment_status":"closed","ping_status":"closed","template":"","meta":[],"_links":{"self":[{"href":"https:\/\/www.westamerica.com\/wp-json\/wp\/v2\/pages\/1618"}],"collection":[{"href":"https:\/\/www.westamerica.com\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/www.westamerica.com\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/www.westamerica.com\/wp-json\/wp\/v2\/users\/3"}],"replies":[{"embeddable":true,"href":"https:\/\/www.westamerica.com\/wp-json\/wp\/v2\/comments?post=1618"}],"version-history":[{"count":50,"href":"https:\/\/www.westamerica.com\/wp-json\/wp\/v2\/pages\/1618\/revisions"}],"predecessor-version":[{"id":5342,"href":"https:\/\/www.westamerica.com\/wp-json\/wp\/v2\/pages\/1618\/revisions\/5342"}],"up":[{"embeddable":true,"href":"https:\/\/www.westamerica.com\/wp-json\/wp\/v2\/pages\/458"}],"wp:attachment":[{"href":"https:\/\/www.westamerica.com\/wp-json\/wp\/v2\/media?parent=1618"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}