{"id":2517,"date":"2019-02-21T16:52:43","date_gmt":"2019-02-21T16:52:43","guid":{"rendered":"http:\/\/dev.westamerica.com\/?page_id=2517"},"modified":"2021-01-22T17:22:24","modified_gmt":"2021-01-22T17:22:24","slug":"preventing-business-losses","status":"publish","type":"page","link":"https:\/\/www.westamerica.com\/business\/preventing-business-losses\/","title":{"rendered":"Preventing Business Losses"},"content":{"rendered":"<h2>Business Banking<\/h2>\n<p><span style=\"width: 100%;\"><img alt=\"Business Services\" width=\"877\" height=\"155\" title=\"BUSINESS_SERVICES\" data-id=\"5304\" src=\"https:\/\/www.westamerica.com\/wp-content\/uploads\/2021\/01\/BUSINESS_SERVICES.png\" style=\"\" scale=\"0\" data-width=\"877\" data-height=\"155\" data-init-width=\"850\" data-init-height=\"150\" loading=\"lazy\"><\/span><\/p>\n<h1>preventing Business Losses<\/h1>\n<p>Loss prevention is an important part of managing your business. Here are some helpful suggestions and simple steps to take to help mitigate potential losses:<\/p>\n<p><strong>related resources<\/strong><\/p>\n<ul>\n<li><span><a href=\"\/business\/checking\/order-checks\/\" style=\"outline: none;\">Order Checks<\/a><\/span><\/li>\n<li><span><a href=\"http:\/\/creditcardlearnmore.com\/11t3\/index?ecdma-lc=12109&amp;ecid=OTHE_25940\" style=\"outline: none;\">Apply for Credit Card<\/a><\/span><\/li>\n<li><span><a href=\"\/business\/services\/\" style=\"outline: none;\">Business Services<\/a><\/span><\/li>\n<\/ul>\n<h4>Separation of Responsibilities<\/h4>\n<p>Maintaining adequate checks and balances is essential in protecting your company. It is strongly recommended that you:<\/p>\n<ul>\n<li>Separate the responsibility for issuing checks from that of balancing and reconciling statements. When the same employee performs both functions without external audit, fraudulent activity can go undetected.<\/li>\n<li>Prohibit the bookkeeper from signing checks.<\/li>\n<li>Assign someone other than the bookkeeper to:- Open and review bank statements.- Pick up statements or payroll held at the bank.- Prepare any listings of checks received by mail.- Reconcile check listings to cash receipt journals.<\/li>\n<\/ul>\n<h4>Statement Reconciliation<\/h4>\n<p>Reconcile your bank statements promptly — within two or three days after receipt. You are responsible for exercising reasonable care and promptness in examining bank statements and items. Upon discovery of unauthorized signatures or any alteration on an item, the customer must notify the Bank promptly when:<\/p>\n<ul>\n<li>The Bank sends the customer a statement of account accompanied by items paid in good faith.<\/li>\n<li>The Bank holds the statement and items at the request of the customer.<\/li>\n<li>The Bank otherwise makes the statement and items available to the customer in a reasonable manner.<\/li>\n<\/ul>\n<h4>Security and Control of Account Documents<\/h4>\n<p>Here are some basic guidelines to protect your company&#8217;s assets:<\/p>\n<ul>\n<li>Store your reserve supply of blank checks in a secure, locked location that is accessible only to authorized personnel.<\/li>\n<li>Lock your working supply of blank checks in a secure place when they are not in actual use and keep them separate from your reserve supply.<\/li>\n<li>Review check orders immediately when they arrive from the printer to verify all account information, including consecutive check numbers. Report any missing checks to the Bank.<\/li>\n<li>Authorize specific employees to use facsimile signature machines.<\/li>\n<li>Lock machines when not in use.<\/li>\n<li>Never use a &#8220;rubber stamp&#8221; for signing checks.<\/li>\n<li>Avoid authorized signatures that are illegible or easily forged.<\/li>\n<li>Discourage &#8220;blanket letters&#8221; authorizing non-signers to receive information, make authorizations, discuss overdrafts, cash checks and receive &#8220;less cash&#8221; on a deposit. All letters should be specific and authorize only single transactions on a one-time basis.<\/li>\n<li>When the Bank calls a signer for verification of information, make sure the caller is not transferred to bookkeepers who may be in control of the transaction.<\/li>\n<li>Retain and account for all voided checks.<\/li>\n<\/ul>\n<h4>Proper Check Issuing Procedures<\/h4>\n<p>Take these precautions to keep your disbursements secure.<\/p>\n<ul>\n<li>Checks exchanged for cashier&#8217;s checks should be made payable to the Bank, with a notation on the memo line stating &#8220;For Cashier&#8217;s Checks.&#8221;<\/li>\n<li>Checks used for transferring money between accounts should be made payable to the name of the account to which they are being deposited.<\/li>\n<li>When making tax payments, checks intended for federal tax payments should be made payable to the Bank with a notation on the memo line stating &#8220;For Federal Tax Payment,&#8221; &#8220;For U.S. Treasury Department,&#8221; or &#8220;For Federal Reserve Banks.&#8221;<\/li>\n<\/ul>\n<h4>Prudent Hiring Practices<\/h4>\n<p>Follow these steps to ensure you make good hiring choices and minimize employee fraud.<\/p>\n<ul>\n<li>Before hiring a new employee, take the time to verify references and recent places of employment.<\/li>\n<li>Telephone previous employers to confirm all relevant information supplied by the applicant.<\/li>\n<li>Bond employees who are in positions of trust.<\/li>\n<li>Require all employees to take an annual vacation and assign their job duties to others. Consider requiring employees involved in finance to take two consecutive weeks of vacation.<\/li>\n<li>Notify the Bank immediately when an employee who is authorized to transact business with the Bank leaves your employ.<\/li>\n<\/ul>\n<h4>Safety Tips for Transporting Funds<\/h4>\n<p>Implement safety procedures for transporting funds to help reduce your exposure to robbery and limit your liability. Review your company&#8217;s procedures with all employees, including temporary ones. Make sure all employees know what to do and who to contact if an emergency occurs, and train them not to take unnecessary risks.<\/p>\n<ul>\n<li>Consider using an armored car service. If you have an armored car service that provides change to your place of business, consider having the service transport deposit funds. These companies are bonded and assume the liability when transporting and depositing funds.<\/li>\n<li>Avoid establishing patterns or routines when transporting funds. Vary the time from day-to-day and vary the vehicle used, if possible.<\/li>\n<li>Do not make any additional stops.<\/li>\n<li>Do not display bank money bags or other containers which suggest the presence of money.<\/li>\n<li>All checks should be stamped &#8220;For Deposit Only&#8221; to the account in case the checks are stolen.<\/li>\n<li>Use two people to drop off funds – they may follow each other to the bank in separate vehicles and use discretion when choosing who will transport money.<\/li>\n<li>Do not talk about the deposit to anyone – including staff. It should only be a need-to-know discussion.<\/li>\n<li>Do not exit your business with the funds if you notice anything suspicious. Call the police immediately if you notice anything suspicious.<\/li>\n<li>If you feel you are being followed, do not go to an isolated area.<\/li>\n<li>Look in and around your vehicle prior to entering it and keep your vehicle locked at all times. Always have your vehicle in good repair, with ample gas.<\/li>\n<li>Carry a cellular phone; pre-program the non-emergency phone number of your local police.<\/li>\n<\/ul>\n<h4>Loss Prevention Tips<\/h4>\n<p>Here are some best practices for preventing losses to your business.<\/p>\n<ul>\n<li>Reconcile cash register tapes or other documents to cash receipt journals.<\/li>\n<li>Deposit cash receipts daily.<\/li>\n<li>Have two employees verify large amounts of incoming cash.<\/li>\n<li>Break down cash deposits by denomination (on the deposit slip) and have two employees verify.<\/li>\n<li>Use duplicate deposit slips and have the Bank stamp receipt the duplicate.<\/li>\n<li>Record all cash discounts and allowances and ensure periodic management review.<\/li>\n<li>Use pre-numbered checks for all disbursements.<\/li>\n<li>Never issue blank checks.<\/li>\n<li>Approve all invoices for payment, and note payment date and check number on each invoice.<\/li>\n<li>Check invoices for unexplained past-due amounts.<\/li>\n<li>Provide supporting documents (such as invoices or delivery receipts) to the check signer with the check to be signed.<\/li>\n<li>Mail signed checks directly, rather than returning them to the preparer.<\/li>\n<li>Do not make checks payable to &#8220;cash&#8221; or &#8220;petty cash.&#8221;<\/li>\n<li>Document petty cash disbursements with approved vouchers.<\/li>\n<\/ul>\n<p>This information is provided by Westamerica Bancorporation as a service to its clients, and is not a claim that losses will be prevented if the guidelines are followed.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Business Banking preventing Business Losses Loss prevention is an important part of managing your business. Here are some helpful suggestions and simple steps to take to help mitigate potential losses: related resources Order Checks Apply for Credit Card Business Services Separation of Responsibilities Maintaining adequate checks and balances is essential in protecting your company. It &hellip;<\/p>\n<p class=\"read-more\"> <a class=\"\" href=\"https:\/\/www.westamerica.com\/business\/preventing-business-losses\/\"> <span class=\"screen-reader-text\">Preventing Business Losses<\/span> Read More &raquo;<\/a><\/p>\n","protected":false},"author":3,"featured_media":0,"parent":1061,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"","meta":[],"_links":{"self":[{"href":"https:\/\/www.westamerica.com\/wp-json\/wp\/v2\/pages\/2517"}],"collection":[{"href":"https:\/\/www.westamerica.com\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/www.westamerica.com\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/www.westamerica.com\/wp-json\/wp\/v2\/users\/3"}],"replies":[{"embeddable":true,"href":"https:\/\/www.westamerica.com\/wp-json\/wp\/v2\/comments?post=2517"}],"version-history":[{"count":45,"href":"https:\/\/www.westamerica.com\/wp-json\/wp\/v2\/pages\/2517\/revisions"}],"predecessor-version":[{"id":5392,"href":"https:\/\/www.westamerica.com\/wp-json\/wp\/v2\/pages\/2517\/revisions\/5392"}],"up":[{"embeddable":true,"href":"https:\/\/www.westamerica.com\/wp-json\/wp\/v2\/pages\/1061"}],"wp:attachment":[{"href":"https:\/\/www.westamerica.com\/wp-json\/wp\/v2\/media?parent=2517"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}