{"id":3029,"date":"2019-03-06T21:13:17","date_gmt":"2019-03-06T21:13:17","guid":{"rendered":"http:\/\/dev.westamerica.com\/?page_id=3029"},"modified":"2021-01-22T16:56:53","modified_gmt":"2021-01-22T16:56:53","slug":"faqs","status":"publish","type":"page","link":"https:\/\/www.westamerica.com\/estatements\/faqs\/","title":{"rendered":"eStatements FAQs"},"content":{"rendered":"<h2>eStatements<\/h2>\n<p><span style=\"width: 100%;\"><img alt=\"Personal Online Banking\" width=\"877\" height=\"155\" title=\"PERSONAL_ONLINE_BANKING\" data-id=\"5308\" src=\"https:\/\/www.westamerica.com\/wp-content\/uploads\/2021\/01\/PERSONAL_ONLINE_BANKING.png\" style=\"\" scale=\"0\" data-width=\"877\" data-height=\"155\" data-init-width=\"850\" data-init-height=\"150\" loading=\"lazy\"><\/span><\/p>\n<h1>eStatements Frequently Asked Questions<\/h1>\n<h4>What is an eStatement?<\/h4>\n<p>An eStatement is an electronic version of your checking or savings account statements. You will receive an email when your statement is ready. You then log into a secure website to view your eStatement and images of your cancelled checks. You have the option to save and\/or print your statement or check images.<\/p>\n<h4>What are the benefits of switching to eStatements?<\/h4>\n<p tve-droppable\"\"=\"\">By making the switch to eStatements, you can: <\/p>\n<ul>\n<li tve-droppable\"\"=\"\">Access your statements 24 hours a day from anywhere you have internet access. <\/li>\n<li tve-droppable\"\"=\"\">Reduce the risk of mail fraud and identity theft that comes with paper delivery. <\/li>\n<li tve-droppable\"\"=\"\">Get organized and reduce the clutter of paper statements. <\/li>\n<li tve-droppable\"\"=\"\">Help to protect the environment.<\/li>\n<\/ul>\n<h4>Will my eStatement look the same as my regular printed statement?<\/h4>\n<p>Yes, your eStatement is just the same as your paper statement and is considered an official document. It contains all the information from your paper statements, but includes the added convenience of images of your cancelled checks.<\/p>\n<h4>Are eStatements secure?<\/h4>\n<p>With eStatements, your personal and financial information are protected on a secure server, and the information can only be accessed with the authorized Login ID and password. When you are ready to leave the secure site, always log out to end your session.<\/p>\n<h4>How do I know if I am on a secure site?<\/h4>\n<p>Transport Layer Security (TSL) is used to access secure web pages. These pages use the prefix HTTPS, while regular web pages use HTTP. For example, when you view your eStatements you are viewing them from a secure site https:\/\/www.internet-estatements.com\/westamerica\/index.asp. The HTTPS prefix shows that the page you are viewing was encrypted before being transmitted over the Internet. Encryption makes it very difficult for an unauthorized individual to view information transferring between computers, according to VeriSign Trust Network, a certificate authority trusted for verifying the identity of websites.<\/p>\n<h4>If I have StarConnect Plus™ or Onsite Banker Plus Online Banking, do I need to remember another ID and password to get eStatements?<\/h4>\n<p>No, StarConnect Plus and Onsite Banker Plus customers will log in to Online Banking using their existing ID and password. Once logged in you simply click on the &#8220;eStatements&#8221; link in the main menu for StarConnect Plus customers or the &#8220;Online Requests&#8221; tab of Onsite Banker Plus and select eStatements.<\/p>\n<h4>How do I view my eStatements?<\/h4>\n<p>After logging in, you will make a selection from: <\/p>\n<ul>\n<li>A list of your enrolled checking and\/or savings accounts for which eStatements are available. <\/li>\n<li>If applicable, a list of Unviewed Documents available to be viewed for the first time. After you view a document listed in Unviewed Documents, the link no longer appears, however you can still access the document from your list of accounts.<\/li>\n<\/ul>\n<h4>Should I log out of eStatements when I&#8217;m finished with my session?<\/h4>\n<p>Yes, when you are ready to leave the secure site, always click on the Log Out button to end your session.<\/p>\n<h4>What are the hardware and software requirements for eStatements?<\/h4>\n<p>To view, download, and\/or print eStatements, you will need a computer with an internet connection. Your internet browser must be current and you will need a current version of Adobe Acrobat Reader; if you do not have it, you can&nbsp;<a href=\"http:\/\/www.adobe.com\/products\/acrobat\/readstep2.html\" rel=\"noopener\" target=\"_blank\">download Adobe Reader<\/a> for free.<\/p>\n<h4>How long will my eStatements be available for me to view?<\/h4>\n<p>Your eStatements are available to you for two years. For example, if your first eStatement is for the month of December 2014, you can continue to view that statement and any check images until December 2016. Each eStatement after your first will increase the “history” of statements available to be viewed, until 24 months of statements have accumulated. You may choose to save your eStatements on your own computer system and store those files for as long as you like. Printed statements you received prior to switching to eStatements are not available to be viewed.<\/p>\n<h4>How will I know when a new eStatement is available?<\/h4>\n<p>We will send you an e-mail at the close of each statement cycle to let you know that your current statement is available. This will usually occur the day after your statement cycles. If you prefer NOT to receive an e-mail notice when your statement is ready, go to your eStatements Preferences to update your Delivery Options.<\/p>\n<h4>If I enroll a joint account in eStatements, will the other owner receive an e-mail notice when our statement is ready for viewing?<\/h4>\n<p>No. Each customer who enrolls in eStatements will receive an e-mail notice when a statement is ready. If you prefer NOT to receive an e-mail notice when your statement is ready, go to your eStatements Preferences to update your Delivery Options.<\/p>\n<h4>What if I change my e-mail address?<\/h4>\n<p>You’ll be able to update your e-mail address by going to your eStatements Preferences. StarConnect Plus customers must update StarConnect Plus options by clicking on MyProfile. Regardless of which email address the notice is delivered to, you can still log in and view your statement.<\/p>\n<h4>If I sign up for eStatements, will I still receive my paper statements?<\/h4>\n<p>We discontinue your paper statements when you switch to eStatements. You can view, save, and print your eStatements at any time, and they are legally the same as a paper version mailed by us. If you have additional needs, please contact us.<\/p>\n<h4>If I enroll a joint account in eStatements, will the other owner continue to receive paper statements?<\/h4>\n<p>No. We discontinue paper statements when you switch to eStatements. The other account holder may also enroll in eStatements, and you will both be able to view them online.<\/p>\n<h4>Can I save and\/or print my eStatements?<\/h4>\n<p>Yes. Your eStatements are stored on our secure server, but if you choose, you may print or download a copy to your own system. While viewing your eStatement, simply click on the “save” icon in the Acrobat Reader toolbar located directly above the statement, and indicate the path and filename of your choosing. If you wish to print your eStatement, click on the Acrobat Reader “print” icon.<\/p>\n<h4>What if I need a statement that is not listed in eStatements?<\/h4>\n<p>You can always request a copy of older statements by calling our Customer Service Department anytime at (800) 848-1088. Certain fees may apply to these paper copies; see our current Schedule of Fees and Charges.<\/p>\n<h4>Can I save and\/or print my check images?<\/h4>\n<p>Yes. Your check images are stored on our secure server, but if you choose, you may print or save a copy to your own system. To save pages of check images:<\/p>\n<ul>\n<li>Select Paged Check Images,<\/li>\n<li>Click on the PDF button on the far right side above the page of images<\/li>\n<li>Click on the “save” icon in the Acrobat Reader toolbar located directly above the resulting page of images and indicate the path and filename of your choosing.&nbsp;<\/li>\n<\/ul>\n<p>To print pages of check images from the Paged Check Images View:<\/p>\n<ul>\n<li>Click on the Print button in the center of the toolbar located directly above the page of images. <\/li>\n<li>You can also print pages of check images after clicking on the PDF button, by clicking on the Acrobat Reader “print” icon.<\/li>\n<\/ul>\n<h4>What is the PDF button for?<\/h4>\n<p>The PDF (Portable Document Format) button appears when you view pages of check images. Clicking the PDF button creates a similar display of check images on your monitor, but these pages are in a format that allows you to save and\/or print them using Adobe Acrobat Reader (see related questions above).<\/p>\n<h4>What if I want to cancel eStatements and switch back to paper?<\/h4>\n<p>To resume receiving your paper statements in the mail, simply contact us. Note that fees may apply to receive a paper statement; see our current Schedule of Fees and Charges. You may contact your local branch or our Customer Service Department at (800) 848-1088.<\/p>\n<h4>What if I forget my Login ID and\/or password?<\/h4>\n<p>Just call us at (800) 848-1088.<\/p>\n<h4>What if I have other questions?<\/h4>\n<p>Please call us at (800) 829-8629.<\/p>\n<p><strong>related resources<\/strong><\/p>\n<ul>\n<li><span><a href=\"\/estatements\/\">eStatements<\/a><\/span><\/li>\n<\/ul>\n","protected":false},"excerpt":{"rendered":"<p>eStatements eStatements Frequently Asked Questions What is an eStatement? An eStatement is an electronic version of your checking or savings account statements. You will receive an email when your statement is ready. You then log into a secure website to view your eStatement and images of your cancelled checks. You have the option to save &hellip;<\/p>\n<p class=\"read-more\"> <a class=\"\" href=\"https:\/\/www.westamerica.com\/estatements\/faqs\/\"> <span class=\"screen-reader-text\">eStatements FAQs<\/span> Read More &raquo;<\/a><\/p>\n","protected":false},"author":3,"featured_media":0,"parent":3023,"menu_order":7,"comment_status":"closed","ping_status":"closed","template":"","meta":[],"_links":{"self":[{"href":"https:\/\/www.westamerica.com\/wp-json\/wp\/v2\/pages\/3029"}],"collection":[{"href":"https:\/\/www.westamerica.com\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/www.westamerica.com\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/www.westamerica.com\/wp-json\/wp\/v2\/users\/3"}],"replies":[{"embeddable":true,"href":"https:\/\/www.westamerica.com\/wp-json\/wp\/v2\/comments?post=3029"}],"version-history":[{"count":38,"href":"https:\/\/www.westamerica.com\/wp-json\/wp\/v2\/pages\/3029\/revisions"}],"predecessor-version":[{"id":5386,"href":"https:\/\/www.westamerica.com\/wp-json\/wp\/v2\/pages\/3029\/revisions\/5386"}],"up":[{"embeddable":true,"href":"https:\/\/www.westamerica.com\/wp-json\/wp\/v2\/pages\/3023"}],"wp:attachment":[{"href":"https:\/\/www.westamerica.com\/wp-json\/wp\/v2\/media?parent=3029"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}