{"id":4559,"date":"2020-05-12T17:50:36","date_gmt":"2020-05-12T17:50:36","guid":{"rendered":"https:\/\/www.westamerica.com\/?page_id=4559"},"modified":"2021-01-12T23:32:01","modified_gmt":"2021-01-12T23:32:01","slug":"loan-forgiveness","status":"publish","type":"page","link":"https:\/\/www.westamerica.com\/ppp\/loan-forgiveness\/","title":{"rendered":"Loan Forgiveness"},"content":{"rendered":"<h1>Paycheck Protection Program Loan<\/h1>\n<h2>An Overview of the Loan Forgiveness Application Process<\/h2>\n<p><strong>Updated July 8, 2020<\/strong>Once your Paycheck Protection Program loan has been disbursed you should be preparing to apply for loan forgiveness. Loan amounts may be forgiven, in whole or in part, if proceeds are used for eligible business expenses in the covered period following the loan disbursement date. You must submit an online application and provide documentation verifying loan proceeds were used for eligible expenses.<\/p>\n<p><strong>Deferral Period<\/strong>The deferral period during which you are not required to make payments of principal, interest and fees, ends on the date the SBA remits your loan forgiveness amount to Westamerica Bank. If you do not apply for loan forgiveness, the deferral period extends 10 months after the end of your loan forgiveness covered period.<\/p>\n<p><strong>Covered Period<\/strong>The covered period for loan forgiveness ends 24 weeks after the date of loan disbursement. &nbsp;Borrowers who received PPP loans prior to June 5 retain the option to use an eight-week covered period.<\/p>\n<p><strong>Eligible Expenses&nbsp;<\/strong>At least 60% of loan proceeds must be for payroll and benefit costs and be paid or incurred during the covered period. No more than 40% of loan proceeds can be used on non-payroll expenses:<\/p>\n<ul>\n<li>Interest on mortgage obligations, incurred before February 15, 2020;<\/li>\n<li>Rent, under lease agreements in force before February 15, 2020; and<\/li>\n<li>Utilities, for which service began before February 15, 2020.<\/li>\n<\/ul>\n<p><strong>Document and Organize Your Expenses<\/strong>Carefully document and organize your business expenses. Documentation you will be required to provide is summarized below.&nbsp;<strong><a href=\"\/ppp\/loan-forgiveness\/documents\/\" style=\"outline: none;\">Click here<\/a><\/strong> for a more detailed description of required documentation.<\/p>\n<ul>\n<li>If you use a payroll provider, request reports or documents verifying the number of full-time equivalent employees and pay rates. If you do not use a payroll provider, documentation could include payroll registers and payments to benefits providers.<\/li>\n<li>Proof of payments made for eligible mortgage interest and rent.<\/li>\n<li>Proof of payments, invoices and statements for utilities such as telephone, internet, gas and electrical services.<\/li>\n<\/ul>\n<p><strong>Applying for Loan Forgiveness<\/strong>Existing SBA guidance does not allow for a second forgiveness application to be submitted, so ensure all funds are used for eligible expenses prior to applying for forgiveness.<\/p>\n<p>At approximately the 24-week mark, you will receive an additional email with a unique application link to our Loan Forgiveness application portal. Check your email for messages from <a href=\"mailto:SBA.Lending@westamerica.com\" rel=\"noreferrer noopener\" target=\"_blank\" style=\"outline: none;\">SBA.Lending@westamerica.com<\/a>. Note that we can only accept forgiveness applications online.<\/p>\n<p><strong>Submitting a Forgiveness Application Online<\/strong>When you are confident you meet the SBA requirements for loan forgiveness, be sure you have all of your supporting documentation available for upload prior to starting the application. You will use the unique link provided to you via email to access the application portal.<\/p>\n<p>Once a completed Loan Forgiveness application is received, Westamerica has up to 60 days to complete the application review and send a notification to the SBA. You will be contacted via email with information requests or status updates. Check your email for messages from <a data-behavior=\"truncate\" href=\"mailto:SBA.Lending@westamerica.com\" rel=\"noreferrer noopener\" target=\"_blank\" style=\"outline: none;\">SBA.Lending@westamerica.com<\/a>.<\/p>\n<p>The Paycheck Protection Program is administered by the Small Business Administration. The terms and qualifications for determining forgiveness amounts are established by the SBA. While Westamerica is responsible for conducting a good-faith review of reported information and calculations, we are unable to offer guidance on the SBA rules.&nbsp;<\/p>\n<p>As it is the borrower’s obligation to stay informed about program rules, visit&nbsp;<a href=\"http:\/\/www.sba.gov\/\" target=\"_blank\" style=\"outline: none;\" rel=\"noopener noreferrer\">www.sba.gov<\/a> for detailed information on the Paycheck Protection Program.&nbsp;<\/p>\n<p><strong><strong>related resources<\/strong><\/strong><\/p>\n<ul>\n<li><span><a href=\"\/paycheck-protection-program\/info\/\" style=\"outline: none;\">Information about the Paycheck Protection Program<\/a><\/span><\/li>\n<li><span><a href=\"\/paycheck-protection-program\/guide\" style=\"outline: none;\">Paycheck Protection Program Document Guide<\/a><\/span><\/li>\n<li><span><a href=\"\/ppp\/loan-forgiveness\" style=\"outline: none;\">Loan Forgiveness Information<\/a><\/span><\/li>\n<\/ul>\n","protected":false},"excerpt":{"rendered":"<p>Paycheck Protection Program Loan An Overview of the Loan Forgiveness Application Process Updated July 8, 2020Once your Paycheck Protection Program loan has been disbursed you should be preparing to apply for loan forgiveness. Loan amounts may be forgiven, in whole or in part, if proceeds are used for eligible business expenses in the covered period &hellip;<\/p>\n<p class=\"read-more\"> <a class=\"\" href=\"https:\/\/www.westamerica.com\/ppp\/loan-forgiveness\/\"> <span class=\"screen-reader-text\">Loan Forgiveness<\/span> Read More &raquo;<\/a><\/p>\n","protected":false},"author":3,"featured_media":0,"parent":4334,"menu_order":5,"comment_status":"closed","ping_status":"closed","template":"","meta":[],"_links":{"self":[{"href":"https:\/\/www.westamerica.com\/wp-json\/wp\/v2\/pages\/4559"}],"collection":[{"href":"https:\/\/www.westamerica.com\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/www.westamerica.com\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/www.westamerica.com\/wp-json\/wp\/v2\/users\/3"}],"replies":[{"embeddable":true,"href":"https:\/\/www.westamerica.com\/wp-json\/wp\/v2\/comments?post=4559"}],"version-history":[{"count":34,"href":"https:\/\/www.westamerica.com\/wp-json\/wp\/v2\/pages\/4559\/revisions"}],"predecessor-version":[{"id":5249,"href":"https:\/\/www.westamerica.com\/wp-json\/wp\/v2\/pages\/4559\/revisions\/5249"}],"up":[{"embeddable":true,"href":"https:\/\/www.westamerica.com\/wp-json\/wp\/v2\/pages\/4334"}],"wp:attachment":[{"href":"https:\/\/www.westamerica.com\/wp-json\/wp\/v2\/media?parent=4559"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}